[
	{
		"Id": "rememberCheckBox",
		"title": "Remember ROM",
		"screenshot": "rememberCheckBox.png",
		"description": "Allows the website to remember the file location of the ROM you wish to use in the future."
	},
	{
		"Id": "tournamentSafeCheckBox",
		"title": "Tournament Safe ROM",
		"screenshot": "tournamentSafeCheckBox.png",
		"description": "Verifies that the ROM provided is an original Final Fantasy 1 ROM. If the ROM has been modified beyond certain allowances (the sprites for the main heroes on the map and in battle may be changed, as well as the vehicles), a randomized ROM will fail to generate and the site will spit out the following error: -- FAILURE: file has been modified --\n\nWhen this flag is turned on, the Damage Tile Flicker and Spellcasting Flash are also disabled, regardless of the preferences selected.\nAdditionally, the Crop Friendly flag is enabled, regardless of the preferences selected."
	},
	{
		"Id": "spoilersCheckBox",
		"title": "Generate Spoiler Log!",
		"screenshot": "downloadSpoilersCheckBox.png",
		"description": "Download a spoiler log for the current seed. The resulting ROM's randomization will be different than if the log had not been generated in order to prevent cheating in races.\nNote: You may be asked by your browser to allow downloading multiple files when using this option."
	},
	{
		"Id": "blindseedCheckBox",
		"title": "Hide Flags",
		"screenshot": "blindseed.png",
		"description": "Hides all flags to create a mystery flagset that can then be distributed. Useful for tournament and challenge race settings.\n This flag cannot be disabled once clicked; you will need to hit the Reset button to restore functionality to the site (and this will, in turn, wipe the hidden flags selected). Make sure to save your flagset before you use this flag."
	},
	{
		"Id": "ribbonMode",
		"title": "Ribbon Mode",
		"screenshot": null,
		"description": "Shattered spreads the resistances across many armor pieces. Each Element occurs multiple times. It tries to ensure that every class can attain full protection."
	},
	{
		"Id": "shipCanalBeforeFloater",
		"title": "Ship and Canal before Floater",
		"screenshot": null,
		"description": "Forces the Ship and the Canal to be placed before the Floater. This means they will appear earlier in logic and makes it more likely they will be required."
	},
	{
		"Id": "reversedFloors",
		"title": "Swapped Entrance & Exit Locations",
		"screenshot": null,
		"description": "Where meaningfully possible, swaps entrance and exit stairs; otherwise, modifies the location of entrance stairs. Some floors are also slightly modified to allow for meaningful relocation of stairs."
	},
	{
		"Id": "noEmptyScripts",
		"title": "No Empty Scripts",
		"screenshot": "enemyScriptsCheckBox.png",
		"description": "Prevents non-boss scripts from being empty.\nWithout this flag, enemies will be more likely to have scripts with both skills and spells. This flag results in spreading them out more, giving about 25% more enemies with scripts on average with a Vanilla Script Count."
	},
	{
		"Id": "mermaidPrison",
		"title": "Mermaid Prison",
		"screenshot": null,
		"description": "Locks all doors on the Mermaid Floor in Sea Shrine, so that the KEY is now required to access the treasures on that floor."
	},
	{
		"Id": "laterLoose",
		"title": "Later Loose",
		"screenshot": null,
		"description": "Makes later placement of loose items more likely."
	},
	{
		"Id": "scriptMultiplier",
		"title": "Everything has a Script",
		"screenshot": "enemyScriptsCheckBox.png",
		"description": "Controls how many non-boss enemies will have a script. Vanilla just shuffles the scripts; all other settings randomize them.\nVanilla means about 30% of enemies will have scripts (Half = ~15%, Increased = ~45%, Double = ~60%, All = 100%, Random = ~15% to ~75%).\nPirates are safe unless declared unsafe."
	},
	{
		"Id": "touchMultiplier",
		"title": "Everything has a Touch",
		"screenshot": "enemyStatusAttacksCheckBox.png",
		"description": "Controls how many non-boss enemies will have a touch effect. Vanilla means about 30% of enemies will have touch attacks (Half = ~15%, Increased = ~45%, Double = ~60%, All = 100%, Random = ~15% to ~75%).\nPirates are safe unless declared unsafe."
	},
	{
		"Id": "importResourcePack",
		"title": "Import Resource Pack",
		"screenshot": "importResourcePack.png",
		"description": "Imports into the game various custom assets like sprites, gamescript and worldmap grouped in a single zip package. See the Wiki for more info."
	},
	{
		"Id": "disableMinimap",
		"title": "Disable Minimap",
		"screenshot": "disableMinimapCheckBox.png",
		"description": "Disables the minimap."
	},
	{
		"Id": "itemMagicMode",
		"title": "Item Magic Shuffling",
		"screenshot": "itemMagicModeDropDown.png",
		"description": "Vanilla: Vanilla item magic or weaponizer/armorcrafter behavior.\n\nRandomized: Change item magic based on Item Magic Pool below (among equipment that normally casts spells when used).\n\nNone: No item magic.\n\nRandom: Any of the above."
	},
	{
		"Id": "itemMagicPool",
		"title": "Item Magic Pool",
		"screenshot": "itemMagicPoolDropDown.png",
		"description": "Sets the pool of Spells for item magic shuffling. (Compatible with Spellcrafter.)\n\nAll Magic: All valid spells.\n\nBalanced: Removes too weak and too strong spells.\n\nLow: Removes too strong spells.\n\nSupport: Removes too strong spells and all damage spells.\n\nCurated: A hand-selected pool that tries to make all item magic you find useful, but rarely strong enough to be dominating. Appropriate for tournament play. (Essentially, a tighter version of \"Balanced\".)\n\nRandom: Any of the above."
	},
	{
		"Id": "enableSoftInBattle",
		"title": "Enable Soft in Battle",
		"screenshot": "enableSoftInBattleCheckBox.gif",
		"description": "Makes the SOFT spell and the SOFT potion work in battle."
	},
	{
		"Id": "lifeInBattleDropDown",
		"title": "Enable Life in Battle",
		"screenshot": "enableLifeInBattleCheckBox.gif",
		"description": "Makes LIFE spells and the PHNIX potion (if enabled - Gear & Items Tab) work in battle. If \"LIFE1 Only\" is selected, LIF2 will only work outside of battle, while LIFE1 and PHNIX potions will also work during battle.\nCombat buffs & debuffs are retained when revived during battle - you will keep the benefits of any FAST, TMPR, FOG, etc. (as well as the detriment of SLOW) that were applied before dying. (Status Ailments such as Poison, Mute, or Stun are removed when the character dies and will not be retained.)"
	},
	{
		"Id": "kiPlacementMode",
		"title": "Key Item Placement",
		"screenshot": "kiPlacementMode.png",
		"description": "Guided: This algorithm uses a semifixed placement order that will always open up the seed with an early SHIP and CANAL.\n\nPredictive: More powerful algorithm that does not rely on a fixed item order. This allows for more flexibility like allowing early fetch quests or opening a seed up with the CANOE instead of the SHIP. It can better handle alternate overworlds and Floor Entrance seeds.\n\nPredictive Unsafe: Removes Safety Checks that prevent the Predictive Algorithm from forcing you into high level dungeons early."
	},
	{
		"Id": "loosePlacementMode",
		"title": "Loose Placement",
		"screenshot": "loosePlacementMode.png",
		"description": "Chaotic: Random Chests and NPCs. Tends to put more key items earlier in progression and into larger dungeons.\n\nSpread: Tries to spread out the loose items into different dungeons and gatings. With Entrance + Floor Shuffle (Maps tab), it tries to spread out the items to different entrances/gatings.\n\nForward: Additionally tries to place loose items into newly opened up areas. It creates key item chains where one key item leads to the next, drives items out into the last corners of the world and can create some really nice fetch quest chains."
	},
	{
		"Id": "looseNpcBalance",
		"title": "Favor NPCs",
		"screenshot": "looseNpcBalanceCheckBox.png",
		"description": "Makes it more likely for any loose items to land on NPCs.\nRequires that one (or both) of the \"Main NPCs\" or \"Fetch Quest NPCs\" flags above are not set."
	},

	{
		"Id": "funEnemyNamesCheckBox",
		"title": "Fun Enemy Names",
		"screenshot": "funEnemyNamesCheckBox.png",
		"description": "Changes enemy names in the generated seed. Most of the name changes in this setting are the result of various community memes over the years and may not make sense to newer players."
	},
	{
		"Id": "teamSteakCheckBox",
		"title": "Team STEAK",
		"screenshot": "teamSteakCheckBox.png",
		"description": "Modifies the Tyro/T-Rex sprite to reflect the age old rivalry between two teams.\n Team Tyro believes firmly in the sanctity of Tyro life while Team Steak believes in the sanctity of Tyro meat dinners. Choosing Team Steak will make it clear what you see when confronting these majestic-but-delicious creatures."
	},
	{
		"Id": "changeLuteCheckBox",
		"title": "Multi-instrumentalist Sara",
		"screenshot": "changeLuteCheckBox.png",
		"description": "Randomly change Princess Sara's Lute to another instrument from a list of over 70 different, community-contributed options."
	},
	{
		"Id": "titanSnackDropDown",
		"title": "Titan's Favorite Snack",
		"screenshot": "titanSnack.png",
		"description": "Randomly change Titan's RUBY to another snack from 100 different, community-contributed options.\n[grid][r]{l}{i}Ruby|{l}Default / Vanilla[r]{l}{i}Other Minerals|{l}Rocks or similar Titan cuisine[r]{l}{i}Junk Food|{l}Human food to eat in moderation[r]{l}{i}Healthy Food|{l}Human food of a healthier variety[r]{l}{i}Beverages|{l}Drinks[r]{l}{i}All|{l}All of the above except Ruby\n"
	},
	{
		"Id": "randomShardNamesCheckBox",
		"title": "Random Shard Names",
		"screenshot": "randomShardName.png",
		"description": "When playing with \"Shard Hunt\" active (Goals Tab), the SHARDs will have random names (such as WEDGEs or ORBLTs)."
	},
	{
		"Id": "hurrayDwarfFateDropDown",
		"title": "Hurray Dwarf's Fate",
		"screenshot": "hurrayDwarfFate.png",
		"description": "Choose if Hurray Dwarf (one of the NPCs in the Dwarf Cave) is spared or killed when NPC Guillotine is turned on. If you choose to kill the Dwarf, he will say one of a number of different random dialogue options before meeting his untimely fate."
	},
	{
		"Id": "paletteSwapCheckBox",
		"title": "Palette Swap",
		"screenshot": "paletteSwapCheckBox.png",
		"description": "Randomizes the colors used for enemies in the generated seed. For example, Imps may be largely pink rather than orange. Note that combining this setting with \"Fun Enemy Names\" can lead to confusion for newer players both due to the strange names and the fact that enemies could appear looking like other, similar ilk. Be wary before turning all these options on together."
	},
	{
		"Id": "modernBattlefieldCheckBox",
		"title": "Modern Battlefield",
		"screenshot": "modernBattlefieldCheckBox.png",
		"description": "Changes the appearance of the battle screen, removing most of the bounding boxes so that it more closely resembles the battle screens seen in later installments in the series (from Final Fantasy II NES and beyond)."
	},
	{
		"Id": "thirdBattlePaletteCheckBox",
		"title": "Three Battle Palettes",
		"screenshot": "thirdBattlePaletteCheckBox.png",
		"description": "Changes the behavior of in-battle color palettes to allow sprite edits to use three different palettes instead of the normal two. This is an advanced option that requires the use of external tools such as FFHackster for importing sprites in order to have a noticeable effect.\n Note: While using the \"Three Battle Palettes\" option, some effects on screen maybe cause unintended side effects during play. These are minor, such as characters struck by Stone changing color in battle as spells are cast, but could be confusing if you're not used to these side effects."
	},
	{
		"Id": "partyMapmanSlotDropDown",
		"title": "Map Character Slot",
		"screenshot": "partyMapmanSlot.gif",
		"description": "Allows the player to select which character appears on the overworld and in dungeons, based on which character position in the party (leader, second, third, or fourth) is selected. This choice is made before the ROM is randomized and can only be altered, in game, by moving your characters around to the selected slot."
	},
	{
		"Id": "musicDropDown",
		"title": "Music Shuffle",
		"screenshot": "musicDropDown.png",
		"description": "Adjusts the behavior of background music during play.\n None leaves all tracks in their normal place.\n Standard music shuffle operates only from the pool of dungeon tracks, along with the overworld theme.\n Nonsensical music shuffle mixes every song in the game into one pool, including shorter tunes that can loop very quickly.\n Disable Music mutes all music, although sound effects, and some very short jingles, will still play. "
	},
	{
		"Id": "disableDamageTileFlickerCheckBox",
		"title": "Disable Damage Tile Flicker",
		"screenshot": "disableDamageTileFlickerCheckBox.gif",
		"description": "Disables screen flashing when stepping over lava tiles. A useful option if you have a sensitivity to flashing lights or bright colors."
	},
	{
		"Id": "disableDamageTileSFXCheckBox",
		"title": "Disable Damage Tile SFX",
		"screenshot": null,
		"description": "Disables the \"ksssshhh\" sound effect when stepping over lava tiles."
	},
	{
		"Id": "disableSpellCastFlashCheckBox",
		"title": "Disable Spell Cast Flash",
		"screenshot": "disableSpellCastFlashCheckBox.gif",
		"description": "Removes the full screen color flash when casting spells. A useful option if you have a sensitivity to flashing lights or bright colors."
	},
	{
		"Id": "menuColorDropDown",
		"title": "Menu Color",
		"screenshot": "MenuColor.gif",
		"description": "Changes your menu screen color from the default blue to a selection of other colors.\n This may also be changed in game by pressing Select at the New Game/Continue screen"
	},
	{
		"Id": "accessibleSpellNamesCheckBox",
		"title": "Accessible Spell Names",
		"screenshot": "accessibleSpellNamesCheckBox.png",
		"description": "Updates spell names to make them more accessible. The table below shows what the new names are when this flag is checked:\n[grid][r]{i}BM - New|{i}BM - Original|{i}WM - New|{i}WM - Original[r]{l}THUN|{l}LIT|{l}PROT|{l}FOG[r]{l}DOZE|{l}SLEP|{l}DIA|{l}HARM[r]{l}THN2|{l}LIT2|{l}ATHN|{l}ALIT[r]{l}HAST|{l}FAST|{l}DIA2|{l}HRM2[r]{l}DOZ2|{l}SLP2|{l}VOX|{l}AMUT[r]{l}THN3|{l}LIT3|{l}DIA3|{l}HRM3[r]||{l}PRO2|{l}FOG2[r]||{l}DIA4|{l}HRM4[r]||{l}HOLY|{l}FADE\n\nNote: This setting is disabled when \"Generate New Spellbooks\" is on"
	},
	{
		"Id": "cleanBlursedEquipmentNamesCheckBox",
		"title": "Cleaner Names for Blursed Weapons & Armor",
		"screenshot": "cleanBlursedEquipmentNames.png",
		"description": "Makes equipment names cleaner when they are shortened by having a Blursing (a random plus or minus to their stats). For example, \"Vorpa+1\" becomes \"Vorpl+1\", \"Heav-3\" becomes \"Hvy -3\", and \"IceH+4\" becomes \"IcHt+4\". This also adjusts generated armor names without an icon, e.g. \"Silve+2\" doesn't indicate where it can be equipped, so is changed to \"SlvrC+2\" or \"SlvrR+2\" to indicate that it is a Cape or Ring.\nThis setting is most relevant when using Weaponizer and Armor Crafter, but affects some vanilla equipment as well. Equipment generated without any stat plus/minus keeps its original long name."
	},
	{
		"Id": "shopInfoIconsCheckBox",
		"title": "Shop Information Icons",
		"screenshot": "shopInfoIconsCheckBox.png",
		"description": "When using Shop Information, elements and statuses are shown as icons, allowing for more information to be displayed."
	},
	{
		"Id": "renounceAutosortCheckBox",
		"title": "Renounce Autosort",
		"screenshot": "renounceAutosortCheckBox.png",
		"description": "Forgo the \"Autosort Inventory\" flag (found under the Conveniences tab) if it is enabled. This will revert the game to it's standard item menu behavior (Key Items up top, potions at the bottom) no matter what flags are selected."
	},
	{
		"Id": "renounceChestInfoCheckBox",
		"title": "Renounce Chest Info",
		"screenshot": "incentivizeOpalCheckBox.png",
		"description": "Forgo the \"Chest Information\" subflag (found under Shop Information) if it is enabled. This will revert to showing only the item name when opening chests."
	},
	{
		"Id": "renounceCantHoldRed",
		"title": "Renounce Can't Hold Red",
		"screenshot": null,
		"description": "When enabled, displays \"Can't Hold\" screens in default menu color even when \"Chest Information\" subflag is enabled."
	},
	{
		"Id": "cropScreen",
		"title": "Crop Friendly Screen",
		"screenshot": "cropScreen.png",
		"description": "Gives the Load/New Game and Party Selection a discernible background color to make life easier for restreamers."
	},
	{
		"Id": "renounceSpeedHackWipes",
		"title": "Slow Down Screen Wipes",
		"screenshot": "OptOutSpeedHackWipes.gif",
		"description": "Opt out of the Convenience flag that speeds up the screen transitions of the game. Reverts screen transitions back a near-vanilla, slow speed."
	},
	{
		"Id": "renounceSpeedHackMessages",
		"title": "Slow Down Battle Messages",
		"screenshot": "OptOutSpeedMessages.gif",
		"description": "Opt out of the Convenience flag that speeds up the message text in battle. Reverts these message windows back to a near-vanilla, slow speed."
	},
	{
		"Id": "renounceSpeedHackDash",
		"title": "Slow Down Movement Speed",
		"screenshot": "OptOutSpeedHackDash.gif",
		"description": "Opt out of the Convenience flag that speeds up characters on maps, both on the overworld and in dungeons. Reverts movement speed back to a near-vanilla, slow speed, although players can still dash if they hold down the B button."
	},
	{
		"Id": "quickJoy2Reset",
		"title": "Quick Controller 2 Reset",
		"description": "Instead of holding Up+A and Up+B on controller 2 for a hard reset and a soft reset, only holding A and B, respectively, is required."
	},
	{
		"Id": "blandSite",
		"title": "Bland Site",
		"description": "Removes the website background and only shows black. (A refresh will be required for changes to take effect.)"
	},
	{
		"Id": "spriteSheetToolTipBox",
		"title": "Custom Player Sprites",
		"screenshot": "customHeroSprites.png",
		"description": "Import custom player sprites. Must use sprite sheets from\nhttp://www.groggy.dog/ffr_sprites/Images/sprites.bmp\nCompatible with Fun % flag Three Battle Palettes.\nNotes for custom sprites:\n1) Use NES colors http://www.groggy.dog/ffr_sprites/Images/NESpalette.png\n2) Maximum of three colors per sprite, plus black (for battle sprites) or transparent (magenta, for mapman sprites)\n3) Mapman can have separate palettes for head and body\n4) All battle sprite postures for a given class must have the same palette\n5) Maximum of two (or three with 'Three Battle Palettes' flag) distinct battle palettes across all classes, classes will need to share palettes, and sprites intended to share a palette need to use exactly same colors in the import image.\n\nImport problems (usually palette problems) will be reported on the Javascript console; use your browser's Web Developer Tools to view the messages.\nSprites are saved when you click 'Save Preferences' in the Fun% menu."
	},
	{
		"Id": "trappedChaosCheckBox",
		"title": "Hidden Chaos",
		"screenshot": "hiddenChaos.png",
		"description": "Chaos is hidden in a random chest and must be found to be defeated. Once you've killed Chaos the game ends. If you find Chaos and then lose, fear not -- the fiend will not move and can be tracked down to the same treasure chest to be fought again."
	},
	{
		"Id": "transformFinalFormationCheckBox",
		"title": "Alternate Final Boss",
		"screenshot": "transformFinalFormationCheckBox.png",
		"description": "Changes the Chaos fight to involve one of several enemy formations instead of just Chaos. These formations are:\n Double Dragons: Kary2 and Tiamat2\n FunDead: 2 buffed Lich2s and 4 buffed Phantoms\n WarMECH and Friends: 2 WarMECHs and 6 Evilmen\n Whack-a-Garland: Chaos and 8 Garlands\nSahagin Wagon: Kraken 1, Kraken 2, 2-4 R.Sahags, and 2-4 WzSahags (9 monsters total with Kraken 1 and kraken 2 forced)\nSnake Pit: Tiamat 1, Tiamat 2, 1-6 Asps, 1-6 Cobras (9 monsters total with Tiamt 1 and Tiamat 2 forced)"
	},
	{
		"Id": "chaosRushCheckBox",
		"title": "Unlocked ToFR",
		"screenshot": "chaosRushCheckBox.gif",
		"description": "Unlocks all locked doors in the Temple of Fiends Revisited, allowing access to Chaos without the need for the KEY."
	},
	{
		"Id": "shortToFRCheckBox",
		"title": "Shorten ToFR",
		"screenshot": "shortToFRCheckBox.png",
		"description": "Shortens the Temple of Fiends Revisited to lead straight to Chaos' Floor. By default, the four Orbs are still required to enter the dungeon.\n Note: Both the KEY and the LUTE will be required if this box is checked, unless other settings are selected that change these requirements."
	},
	{
		"Id": "preserveFiendRefightsCheckBox",
		"title": "Include Fiend Tiles",
		"screenshot": "preserveFiendRefightsCheckBox.gif",
		"description": "Adds the four Fiend refights to the Chaos floor. Two trap tiles will be found on either side south of the entrance, with the boss in each tile shuffled for each seed."
	},
	{
		"Id": "preserveAllFiendRefightsCheckBox",
		"title": "Refight All Fiends",
		"screenshot": "preserveAllFiendRefightsCheckBox.png",
		"description": "Now all four Fiends are in both directions and they must all be defeated to reach CHAOS."
	},
	{
		"Id": "exitToFRCheckBox",
		"title": "Add ToFR Exit",
		"screenshot": "exitToFR.gif",
		"description": "Adds a Warp Portal in ToFR that lets you exit the dungeon, without needing an EXIT or WARP spell.\nThis flag also works with \"Shorten ToFR\"."
	},
	{
		"Id": "chaosFloorEncountersCheckBox",
		"title": "Chaos Floor Encounters",
		"screenshot": "chaosFloorEncounters.gif",
		"description": "Allows enemy encounters to appear on the Chaos floor in the Temple of Fiends Revisited. The list is exclusive to this floor, not simply pulled from another zone, and includes:\n- 12/64 - 3-4 Worms\n- 12/64 - 3-7 Sorcerers\n- 12/64 - 2-4 RockGOLs\n- 12/64 1-2 Evilmen and 1-2 Nighmares\n- 06/64 1-3 WzVamps and 1-2 ZomDs\n- 06/64 1 Phantom\n- 03/65 1 GasD\n- 01/64 2-3 Mages and 1 Fighter"
	},

	{
		"Id": "shardHuntCheckBox",
		"title": "Shard Hunt",
		"screenshot": "shardHuntCheckBox.png",
		"description": "Activates Shard Hunt, a mode in which the Light Warriors must acquire a number of SHARDs in order to open the time gate (the Black Orb) in the Temple of Fiends.\nDefeating Fiends and activating the altars for the four standard orbs will, instead or lighting one big orb, grant the player 2 SHARDs for the Earth and Fire orbs (the Lich and Kary fights in the vanilla game) or 4 SHARDs for the Water and Air orbs (the Kraken and Tiamat fights in the vanilla game).\nThe SHARDs replace generally low-quality items in the treasure pool."
	},
	{
		"Id": "shardCountDropDown",
		"title": "Shard Goal",
		"screenshot": "shardCountDropDown.png",
		"description": "Sets the number of SHARDs the player needs to collect in order to restore the Black Orb and travel into the past to the Temple of Fiends Revisited. Can be set to a fixed amount (i.e., exactly 16 Shards) or a range (i.e., 16-24 Shards).\nThere will always be exactly 32 Shards in the treasure pool regardless of this setting (so 44 total Shards available including fiend fight rewards)."
	},
	{
		"Id": "lichRevengeCheckBox",
		"title": "Lich's Revenge - Halloween Special 2020",
		"screenshot": "LichRevenge.png",
		"description": "Lich is having their revenge, unleashing a zombie apocalypse upon the world!\n- All NPCs are zombies\n- Key NPCs will attack you when giving you their item\n- Buffed undead enemies\n- Lich is the End Boss"
	},
	{
		"Id": "lichRevengePresetCheckBox",
		"title": "Lich's Revenge - Halloween Special 2020",
		"screenshot": "LichRevenge.png",
		"description": "Lich is having their revenge, unleashing a zombie apocalypse upon the world!\n- All NPCs are zombies\n- Key NPCs will attack you when giving you their item\n- Buffed undead enemies\n- Lich is the End Boss"
	},



	{
		"Id": "clampMinimumPriceScaleLable",
		"title": "Price Scaling",
		"screenshot": "clampMinimumPriceScaleLable.png",
		"description": "Sets the scale of the prices of shop items and the value of gold treasure boxes you find.\nAn item's price is randomized by: (Original Price) / (Exp & Gold Multiplier) x (Randomly choosen value between min and max percent).\nThe average cost of an item is (Original Price) / (Exp & Gold Multiplier) x (Average Percent).\nExample: Silver Sword, 3.0x Exp & Gold Boost, 20-100%.\n4000 / 3 x 0.44 = 586g on average."
	},
	{
		"Id": "enemyStatsDoubleSlider",
		"title": "Randomized Enemy Stats",
		"screenshot": null,
		"description": "Enemy stats are randomized between a range comparative to their vanilla values. Enemy & Boss resistances and weaknesses stay the same as vanilla, as do their values for Magic Defense, Morale, and their XP/Gold rewards."
	},
	{
		"Id": "wrapPriceOverflowCheckBox",
		"title": "Wrap Overflowing Prices",
		"screenshot": "wrapPriceOverflowCheckBox.png",
		"description": "If items scale such that their cost is higher than 65,535G (the maximum price an item could have in the vanilla game), this flag will allow those prices to \"wrap\" back to 1G and continue from there.\nFor example, when disabled, an item that should cost 67,000G would cost 65,535G. When enabled, that item would cost 1,465G."
	},
	{
		"Id": "startingGoldDropDown",
		"title": "Starting Gold",
		"screenshot": "startingGoldCheckBox.png",
		"description": "Set the starting gold."
	},
	{
		"Id": "excludeGoldFromScalingCheckBox",
		"title": "Exclude Gold from Scaling",
		"screenshot": "excludeGoldFromScalingCheckBox.png",
		"description": "Gold treasures will only roll to ±10% of their vanilla value instead of scaling with prices. Removes both the price reduction and flat gold bonus from \"Exp. & Gold Boost\"."
	},
	{
		"Id": "cheapVendorItemCheckBox",
		"title": "Exclude Gold from Scaling - Cheap Vendor Item",
		"screenshot": "cheapVendorItemCheckBox.png",
		"description": "Guarantees a less expensive vendor item when excluding gold from scaling."
	},
	{
		"Id": "applyExpBoostToGoldCheckBox",
		"title": "Exclude Gold from Scaling - Apply Flat Gold Boost to Enemies",
		"screenshot": "applyExpBoostToGoldCheckBox.png",
		"description": "Applies the flat gold boost from \"Exp. & Gold Boost\" to enemy rewards even though the multiplier will not be.\nThis, ideally, makes early gold grinds more satisfying."
	},

	{
		"Id": "separateEnemyHPScalingCheckBox",
		"title": "Separate Enemy HP Scaling",
		"screenshot": "separateEnemyHPScalingCheckBox.png",
		"description": "Uses a second scaling for enemy HP independent of the other scaled stats."
	},
	{
		"Id": "separateBossHPScalingCheckBox",
		"title": "Separate Boss HP Scaling",
		"screenshot": "separateBossHPScalingCheckBox.png",
		"description": "Uses a second scaling for boss HP independent of the other scaled stats."
	},
	{
		"Id": "evadeCapDropDown",
		"title": "Evade Cap",
		"screenshot": "evadeCapDropDown.png",
		"description": "Caps the evade of enemies during scaling. When enemies have very high evade it can become near-impossible to hit them; this is especially an issue on Chaos and other endgame bosses."
	},
	{
		"Id": "wrapStatOverflowCheckBox",
		"title": "Wrap Overflowing Scaled Stats",
		"screenshot": "wrapStatOverflowCheckBox.png",
		"description": "Stats that roll above the maximum value in the randomizer will normally remain at the maximum. This flag allows the stats to \"wrap\" back around to 1 and progress from there.\nWhen disabled, a stat which was scaled to 260 would be 255 where as, when enabled, the stat would be 5."
	},
	{
		"Id": "includeMoraleCheckBox",
		"title": "Scaled Stats Includes Morale",
		"screenshot": "includeMoraleCheckBox.png",
		"description": "Includes enemy morale in the stat scaling, as opposed to keeping morale separate (fixed at their vanilla values)."
	},
	{
		"Id": "encounterRatesTooltip",
		"title": "Encounter Rates",
		"screenshot": null,
		"description": "Sets the odds of seeing random encounters. A 1.00x multiplier is the same chance of encounters as vanilla (which is 8 random encounters out of 256 steps in most dungeons, for example).\n\"Most dungeons\" covers the majority of dungeon areas, but there are some areas which have higher encounter rates: The \"Bridge of Destiny\" (the final floor of Sky Fortress where you fight Tiamat-1) has triple the rate, and the fiend floors in ToFR are 13-50% higher."
	},

	{
		"Id": "XPGoldBoostTooltip",
		"title": "Exp/Gold Boost",
		"screenshot": null,
		"description": "Increases the amount of gold and XP you get, and reduces the amount required. The first slider is a divider, which decreases prices and reduces the requirements to level up (e.g. \"2.5x\" means your first level up will require 16xp instead of 40, and a Heal Potion's base cost will be 24g instead of 60). The second slider is a flat value, which adds that much XP and Gold to the amount gained from every monster slayed."
	},
	{
		"Id": "progressiveScaleModeDropDown",
		"title": "Exp/Gold Progressive Scaling",
		"screenshot": "progressiveScaleModeDropDown.png",
		"description": "Increases Exp and Gold gains from enemies (including the flat bonus provided by the 2nd Exp/Gold Boost Slider) based on the number of Key Items collected, including any that were free to start and any that have already been turned in. (Does not, however, include incentivized equipment items.) The bonus is additive, so if it's set to 10% and you have 6 Key Items, your total bonus is 60% (x1.6) more from every enemy defeated.\nWhen Shards are being used, the boost is applied per Shard - so \"50% per 8 Shards\" gives you a 6.25% boost for each Shard you have."
	},

	{
		"Id": "nonesGainXPcheckBox",
		"title": "Nones Gain XP",
		"screenshot": "nonesGainXPcheckBox.png",
		"description": "When enabled, \"None\" characters will count as alive characters for XP calculation and gain their share of XP.\nIf \"Tavern Recruitment Mode\" and/or \"Gated Characters\" are also enabled, characters hired to replace these \"None\" characters will gain all the XP of the None at that point. (If you have already promoted, Recruits replacing Nones will be given their promotion first, and then their XP.)"
	},
	{
		"Id": "deadsGainXPcheckBox",
		"title": "Deads Gain XP",
		"screenshot": "deadsGainXPcheckBox.png",
		"description": "When enabled, dead characters will count as live characters for XP calculation and gain their share of XP."
	},

	{
		"Id": "expChestConversion",
		"title": "Experience Chest Conversion",
		"screenshot": "expChestConversion.png",
		"description": "Chests typically containing Gold can be converted into chests that grant EXP.\nThe slider determines how many Gold chests in the game will be converted into EXP chests."
	},
	{
		"Id": "expChestReward",
		"title": "Experience Chest Reward",
		"screenshot": "expChestReward.gif",
		"description": "Sets the minimum and maximum amounts of EXP that an EXP Chest can grant when opened."
	},


	{
		"Id": "IncentivesTooltip",
		"title": "Incentivized Items & Locations Explanation",
		"screenshot": null,
		"description": "Incentivized Items are guaranteed to be spread out amongst the Incentivized Locations, giving you an idea of where to look for important items.\nIf there are more Items than Locations selected, the excess items will be \"loose\", meaning they will be in random locations. This can be further controlled via the options in the \"Loose Placement\" section. If any Key Items (such as the Tail or Canoe) are not incentivized, they will also be considered loose.\nIf there are more Locations than Items selected, excess locations will be duds, and only contain a random treasure.\nAny Key Items given for free or banned (in the Treasures tab) can't be incentivized, and thus won't be included in the total item count at the top."
	},
	{
		"Id": "IncentiveItemsTooltip",
		"title": "Incentivized Items",
		"screenshot": "incentivizeXcalCheckBox.png",
		"description": "Selecting items from the list below adds them to the pool of items to be distributed amongst the Incentive Locations.\n(See the tooltip next to \"Locations\" for how incentives work in general.)"
	},
	{
		"Id": "incentivizeFreeNPCsCheckBox",
		"title": "Main NPCs",
		"screenshot": "incentivizeFreeNPCsCheckBox.png",
		"description": "Guarantees all \"Main Quest\" NPCs will hold an item from your incentive item pool. These NPCs include: the King, Princess Sara, Bikke, the Canoe Sage, Sarda, the Waterfall Cave Robot, and the Caravan Merchant."
	},
	{
		"Id": "incentivizeFetchNPCsCheckBox",
		"title": "Fetch Quest NPCs",
		"screenshot": "incentivizeFetchNPCsCheckBox.png",
		"description": "Guarantees all \"Fetch Quest\" NPCs will hold an item from your incentive pool. Fetch quest NPCs require their respective key items to gain the item they hold. For example, Astos requires the CROWN in order to get his item. Fetch quest NPCs include: Astos, Matoya, the Elf Prince, the Dwarves, the Lefeinish, and the Fairy."
	},
	{
		"Id": "incentivizeIceCaveCheckBox",
		"title": "Ice Cave Incentive Chest",
		"screenshot": "incentivizeIceCaveCheckBox.png",
		"description": "Vanilla: Incentivizes the FLOATER chest in Ice Cave (pictured)."
	},
	{
		"Id": "incentivizeOrdealsCheckBox",
		"title": "Castle Ordeals Incentive Chest",
		"screenshot": "incentivizeOrdealsCheckBox.png",
		"description": "Vanilla: Incentivizes the TAIL chest at the end of the Castle of Ordeals (pictured)."
	},
	{
		"Id": "incentivizeMarshCheckBox",
		"title": "Marsh Cave Incentive Chest",
		"screenshot": "incentivizeMarshCheckBox.png",
		"description": "Vanilla: Incentivizes the CROWN chest in Marsh Cave's bottom floor (pictured)."
	},
	{
		"Id": "incentivizeTitansCheckBox",
		"title": "Titan’s Trove Incentive Chest",
		"screenshot": "incentivizeTitansCheckBox.png",
		"description": "Vanilla: Incentivizes the leftmost chest in Titan’s Trove. Note that if the \"Titan’s Trove\" map edit is on, this chest will require the RUBY to access."
	},
	{
		"Id": "incentivizeEarthCheckBox",
		"title": "Earth Cave Incentive Chest",
		"screenshot": "incentivizeEarthCheckBox.png",
		"description": "Vanilla: Incentivizes the RUBY chest next to the Vampire in Earth Cave (pictured). The Vampire must be killed to obtain access to this chest.\nPre-Rod: A random chest in the first 3 floors of Earth Cave (before the rod plate) will be incentivized.\nPost-Rod: A random chest on floor 4 of Earth Cave (after the rod plate) will be incentivized."
	},
	{
		"Id": "incentivizeVolcanoCheckBox",
		"title": "Volcano Incentive Chest",
		"screenshot": "incentivizeVolcanoCheckBox.png",
		"description": "Vanilla: Incentivizes the leftmost chest on KARY’s floor (the \"Red D Chest\", pictured). This chest requires passing through two trap tile encounters to access.\nShallow: A random chest on the 2nd floor of Volcano (where the \"armory\" and hairpins are) will be incentivized.\nDeep: A random chest on floor 4-5 (Kary's floor and the floor before it) will be incentivized."
	},
	{
		"Id": "incentivizeSeaShrineCheckBox",
		"title": "Sea Shrine Incentive Chest",
		"screenshot": "incentivizeSeaShrineCheckBox.png",
		"description": "Vanilla: Incentivizes the SLAB chest on the Mermaids floor at the end of the right Sea Shrine path (pictured).\nLocked: The Crescent-shaped \"TFC\" room, on the floor before you get to the Mermaids on the right side of Sea Shrine, will be incentivized and require the KEY to access. If the \"Mermaid Prison\" flag (Map tab) is on, then either the TFC chest or any mermaid chest will be incentivized (and require the KEY).\nUnlocked: the opposited of Locked - a random Sea Shrine chest that does not require the KEY to access will be incentivized."
	},
	{
		"Id": "incentivizeSkyPalaceCheckBox",
		"title": "Sky Palace Incentive Chest",
		"screenshot": "incentivizeSkyPalaceCheckBox.png",
		"description": "Vanilla: Incentivizes the ADAMANT chest (the bottom-left chest on the \"Sky Spider\" floor) in Sky Palace (pictured).\nMirage: A random chest in Mirage Tower will be incentivized, requiring only the CHIME and not the CUBE to access.\nSky: A random chest in the Sky Palace will be incentivized, on any floor after using the CUBE."
	},
	{
		"Id": "incentivizeConeriaCheckBox",
		"title": "Coneria Castle Incentive Chest",
		"screenshot": "incentivizeConeriaCheckBox.png",
		"description": "Vanilla: Incentivizes the TNT chest in the Coneria locked treasury (pictured). This chest requires the KEY to access."
	},
	{
		"Id": "incentivizeMarshKeyLockedCheckBox",
		"title": "Marsh KEY Locked Incentive Chest",
		"screenshot": "incentivizeMarshKeyLockedCheckBox.png",
		"description": "Vanilla: Incentivizes the bottom right chest of the bottom floor of Marsh Cave (pictured). This chest requires the KEY to access."
	},
	{
		"Id": "incentivizeCardiaCheckBox",
		"title": "Cardia Incentive Chest",
		"screenshot": "cardiaIncentive.png",
		"description": "Vanilla: Incentivizes top-right chest in the left-most room of the forest island of the Cardia Islands. The AIRSHIP is required to access, unless combined with the 'Bahamut Cardia Dock' and 'Dragon's Hoard' flags.\nRandom: This item can appear in any of the chests among all of the Cardia Islands."
	},

	{
		"Id": "incentivePlacementType",
		"title": "Incentive Placement Types",
		"screenshot": "incentivizeRandomChestInLocationCheckBox.gif",
		"description": "Vanilla: Sets the incentive chest to be the default chest (pictured in each tooltip) for a given location.\nRandom: Chooses a random chest from all chests at the selected location to act as an incentive chest.\nSome locations will also have additional options, explained in their tooltips."
	},

	{
		"Id": "LooseExcludePlacedDungeonsCheckBox",
		"title": "No Loose Items in Incentivized Dungeons",
		"screenshot": "LooseExcludePlacedDungeons.png",
		"description": "If a dungeon is incentivized, additional loose items and/or unincentivized key items won't be placed inside of it.\nThis means that once you find the incentivized item, you can opt to leave the incentive area knowing that any remaining loose items will be somewhere else.\nNote: Waterfall and other locations such as Matoya's Cave are NOT incentivized even if the NPCS there are (via \"Main NPCs\"), so loose items may still appear in those locations with this checked."
	},

	{
		"Id": "incentivizeMainItemsCheckBox",
		"title": "Main Progression Items",
		"screenshot": "incentivizeMainItemsCheckBox.png",
		"description": "Adds the LUTE, KEY, ROD, OXYALE, CHIME and CUBE to the incentive pool to be distributed in the selected incentive locations."
	},
	{
		"Id": "incentivizeFetchItemsCheckBox",
		"title": "Other Quest Items",
		"screenshot": "incentivizeFetchItemsCheckBox.png",
		"description": "Adds the CROWN, CRYSTAL, HERB, TNT, RUBY, BOTTLE, SLAB, and ADAMANT to the incentive pool to be distributed in the selected incentive locations."
	},
	{
		"Id": "incentivizeShipAndCanalCheckBox",
		"title": "Ship & Canal",
		"screenshot": "incentivizeShipAndCanalCheckBox.png",
		"description": "Adds the SHIP and the CANAL to the incentive pool to be distributed in the selected incentive locations.\nWhen using a vanilla-based overworld map, the Ship will spawn at the nearest inner-sea Dock (defaulting to Coneria). For example, finding the Ship in the Ice Cave will spawn the Ship at Pravoka."
	},
	{
		"Id": "incentivizeBridgeCheckBox",
		"title": "Bridge",
		"screenshot": null,
		"description": "Adds the BRIDGE to the incentive pool to be distributed in the selected incentive locations.\nIt is recommended to only incentivize the Bridge alongside flags that open up the map more, such as \"Extended Open Progression\" and/or \"Bridge to Lefein\", or a Generated Overworld Map, because otherwise the Bridge will always be found very early in a generally uninteresting fashion."
	},
	{
		"Id": "incentivizeOtherCastArmorCheckBox",
		"title": "Power Gauntlet",
		"screenshot": "incentivizeOtherCastArmorCheckBox.png",
		"description": "Adds the Power Gauntlet to the incentive pool to be distributed in the selected incentive locations. The Power Gauntlet is the Guaranteed Offense Item when that flag is enabled."
	},
	{
		"Id": "incentivizePowerRodCheckBox",
		"title": "Power Staff",
		"screenshot": null,
		"description": "Adds the Power Staff to the incentive pool to be distributed in the selected incentive locations. The Power Staff is the Guaranteed Defense Item when that flag is enabled."
	},
	{
		"Id": "incentivizeRibbonCheckBox",
		"title": "Ribbon",
		"screenshot": "incentivizeRibbonCheckBox.png",
		"description": "Adds ONE (1) Ribbon to the incentive pool to be distributed in the selected incentive locations. Other Ribbons may be found in normal chests."
	},

	{
		"Id": "hintsVillage",
		"title": "Hint Givers in Towns",
		"screenshot": "hintsVillage.gif",
		"description": "In each town, a villager reveals the location of an item:\n- The old men in Coneria, Pravoka, Melmond, and Onrac\n- An Elf scholar in Elfland\n- Lukahn in Crescent Lake\n- The Witch in Gaia\n- The villager on the left side of Lefein (no SLAB translation required)\nThe hint givers are always in the same locations, as pictured here. Pravoka's hint giver is hiding until Bikke's Pirates are defeated.\nHints will often be about the locations of incentivized items, but can also hint the location of other useful equipment that may not be incentivized such as Ribbons or Shirts. Occasionally hint givers will just say something silly instead of offering a useful hint."
	},
	{
		"Id": "hintsDungeon",
		"title": "Hints Givers in Dungeons",
		"screenshot": "hintsDungeon.gif",
		"description": "Five NPCs in dungeons each reveal the location of an item. The locations of the NPCs are:\n- Down the dead end of Marsh Cave B1\n- Lich's floor in Earth Cave\n- The hallway of Gurgu Volcano B3\n- One of the mermaids in Sea Shrine\n- The south room of Sky Palace 3F"
	},
	{
		"Id": "hintsUselessCheckBox",
		"title": "Useless Hints",
		"screenshot": "hintsUselessCheckBox.png",
		"description": "Half of the hint-giving NPCs will give useless hints instead."
	},



	{
		"Id": "entrancesCheckBox",
		"title": "Shuffle Entrances",
		"screenshot": "entrancesCheckBox.gif",
		"description": "Overworld entrances (except for towns) are shuffled together, such that the entrance to Earth Cave may be at Waterfall, Volcano may be at the Cardia Islands, etc.\n\"Treasures\" and \"Main NPC Items\" shuffle flags, found in the Treasures tab, must be enabled for this flag to function."
	},
	{
		"Id": "allowUnsafeStartAreaCheckBox",
		"title": "Allow Unsafe Start",
		"screenshot": "allowUnsafeStartAreaCheckBox.gif",
		"description": "When shuffling entrances, FFR normally guarantees 4 'safe' entrances amongst Coneria, Coneria Castle, Dwarf Cave, Temple of Fiends, Matoya's Cave, and Pravoka entrances. This flag removes that safety net.\nFurthermore, if you enable the \"Towns\" shuffle flag and \"Include Coneria\", this flag also removes the guarantee that the Coneria entrance will be a town at all."
	},
	{
		"Id": "deadEndsCheckBox",
		"title": "Include Dead Ends",
		"screenshot": "deadEndsCheckBox.gif",
		"description": "The two empty floors of the Cardia Islands are generally not included in Entrance Shuffle. This flag includes those two floors, and their entrances in the Cardia Islands, into the pool."
	},
	{
		"Id": "floorsCheckBox",
		"title": "Shuffle Floors",
		"screenshot": "floorsCheckBox.gif",
		"description": "Enables the shuffling of all floors in the game. If floors are not shuffled, each area will be moved together as a single unit, such that Earth B1 leads to Earth B2, etc. If floors are shuffled, Earth B1 may lead to Volcano B3, or Sky 1 could lead to the Waterfall, as just two examples."
	},
	{
		"Id": "allowDeepCastlesCheckBox",
		"title": "Deep ToFR",
		"screenshot": "allowDeepCastlesCheckBox.gif",
		"description": "Enables the game to place the first floor of the Temple of Fiends at any level of a dungeon such that multiple floors may have to be crossed to enter the Temple of Fiends.\nIf this flag is active, the whole of the Temple of Fiends will be shuffled as a single unit, so once you find the Temple of Fiends you don't have to search elsewhere for each floor; it's all right there."
	},
	{
		"Id": "townsCheckBox",
		"title": "Shuffle Towns",
		"screenshot": "townsCheckBox.gif",
		"description": "Shuffles the town entrances amongst themselves. When town entrances are shuffled, all towns, aside from Coneria, could appear at any other town, such that the town at Pravoka could be Lefein (or vice-versa).\n \"Treasures\" and \"Main NPC Items\" shuffle flags, found in the Treasures tab, must be enabled for this flag to function."
	},
	{
		"Id": "includeConeriaCheckBox",
		"title": "Include Coneria",
		"screenshot": "includeConeriaCheckBox.png",
		"description": "This will include Coneria in Town Shuffle. This will make for a potentially more difficult start to the seed.\nUnless \"Allow Unsafe Start\" is enabled, the Coneria entrance will always lead to a town.\nNote: Only certain towns (those with Clinics and Item Shops) can appear at the Coneria location; this means only Pravoka, Elfland, Crescent Lake, Onrac, and Gaia. The flag does not take into account Melmondish or Lefeinish Hospitality flags.\nDo note that if you turn on \"Vampire Attacks Random Town\" there's a chance the new town at the Coneria location could be vampire-attacked and, thus, not have a working Item Shop or Clinic."
	},
	{
		"Id": "mixEntrancesCheckBox",
		"title": "Mix All Entrances Together",
		"screenshot": "mixEntrancesCheckBox.gif",
		"description": "Mixes all dungeon and town entrances together. When enabled, the entrance to any location, aside from Coneria Town, could lead to any town or dungeon."
	},
	{
		"Id": "deepTownsCheckBox",
		"title": "Deep Towns",
		"screenshot": "deepTownsCheckBox.gif",
		"description": "Towns are generally found at the top entrances of the world. When this flag is enabled, towns (other than Coneria, unless \"Include Coneria\" is enabled) may be hidden behind dungeon floors, such that Earth B1's staircase may lead to Elfland."
	},

	{
		"Id": "skyCastle4FMazeModeDropDown",
		"title": "Sky Castle 4F",
		"screenshot": "skyCastle4FMazeModeDropDown.gif",
		"description": "Changes the configuration of the teleporters in Sky Castle's 4th Floor.\nNormal: Uses the standard placement of the two teleporters as seen in the vanilla game.\nTeleporters: Moves the location of the teleporters to potentially new places on the floor.\nMaze: Introduces walls so the party must find a way through the maze to the other teleporter, although the teleporter could be anywhere in the maze and not necessarily at the \"end\"."
	},
	{
		"Id": "ordealsPillarsCheckBox",
		"title": "Castle Ordeals Pillars",
		"screenshot": "ordealsPillarsCheckBox.gif",
		"description": "Shuffle the destinations of the teleport pillars on the second floor of the Castle of Ordeals, leading to a completely new maze to navigate each seed."
	},
	{
		"Id": "titansTroveCheckBox",
		"title": "Titan's Trove",
		"screenshot": "titansTroveCheckBox.png",
		"description": "Moves the Titan over a square and edits his map slightly so that, even with the AIRSHIP, it is not possible to reach the Titan's treasure boxes without feeding him the RUBY he craves so dearly."
	},
	{
		"Id": "dragonsHoardCheckBox",
		"title": "Bahamut's Hoard",
		"screenshot": "dragonsHoard.png",
		"description": "Places all the Cardia Islands chests in Bahamut's room.\nNote: This does not remove the Cardia chests at the other locations. Looting the Hoard chests means the linked chests at the other Cardia locations will be empty, and vice versa."
	},
	{
		"Id": "hallOfDragonsCheckBox",
		"title": "Hall of Dragons",
		"screenshot": "hallOfDragons.png",
		"description": "Adds encounters to Bahamut B1 hallway normally leading to Bahamut's room. All encounters will be various forms of dragons."
	},
	{
		"Id": "procGenWaterfall",
		"title": "Generated Waterfall Cave",
		"screenshot": "procGenWaterfall.png",
		"description": "Randomly generates the map for the Waterfall cave creating a new maze each seed."
	},
	{
		"Id": "flipDungeonsCheckBox",
		"title": "Flip Dungeons Horizontally",
		"screenshot": "flipDungeons.png",
		"description": "At random, dungeon floors are flipped horizontally."
	},
	{
		"Id": "verticallyFlipDungeons",
		"title": "Flip Dungeons Vertically",
		"screenshot": "flipDungeons.png",
		"description": "At random, dungeon floors are flipped vertically. Maps are modified to ensure full accessibility to rooms."
	},

	{
		"Id": "mapOpenProgressionCheckBox",
		"title": "Early Open Progression",
		"screenshot": "mapOpenProgressionCheckBox.png",
		"description": "Changes the map to allow walking from Coneria to Dwarf Cave, as well as connecting the Ice Cave and Volcano river systems to allow passage from Pravoka to Crescent Lake with the CANOE."
	},
	{
		"Id": "mapOpenProgressionDwavesNWCheckBox",
		"title": "Extended Open Progression",
		"screenshot": "mapOpenProgressionDwavesNWCheckBox.png",
		"description": "Remove the river tile between the Dwarf Cave and Northwest Castle so that section of the overworld can be traversed on foot (without the need for the CANOE)."
	},
	{
		"Id": "mapOpenProgressionDocksCheckBox",
		"title": "Northern Docks",
		"screenshot": "mapOpenProgressionDocksCheckBox.gif",
		"description": "Adds additional docks near Onrac and the Mirage Tower."
	},
	{
		"Id": "mapOpenProgressionFloaterDockCheckBox",
		"title": "Ryukahn Desert Dock",
		"screenshot": "mapOpenProgressionFloaterDockCheckBox.png",
		"description": "Adds an additional dock near the Ryukhan desert (where you use the Floater to obtain the Airship)."
	},
	{
		"Id": "bahamutCardiaDockCheckBox",
		"title": "Bahamut Cardia Dock",
		"screenshot": "bahamutCardiaDock.png",
		"description": "Adds a dock to Bahamut's island so that the AIRSHIP is not required for class change."
	},
	{
		"Id": "lefeinRiverDockCheckBox",
		"title": "Lefein River Dock",
		"screenshot": "lefeinRiverDock.png",
		"description": "Adds a river dock to the Lefein region, making it accessible without the AIRSHIP."
	},
	{
		"Id": "bridgeToLefeinCheckBox",
		"title": "Bridge to Lefein from Pravoka",
		"screenshot": "bridgeToLefein.png",
		"description": "Makes the Bridge connect Pravoka to Lefein, allowing you to potentially walk to Lefein (or further with additional flags such as \"Gaia Mountain Pass\"). The original Bridge location is now an always-walkable land bridge.\nRemember to disable the \"Free Bridge\" flag if you want the Bridge item to be found in the pool; the Bridge can also be incentivized if desired."
	},
	{
		"Id": "riverToMelmondCheckBox",
		"title": "River to Melmond Region from Dwarf Cave",
		"screenshot": "RiverToMelmond.png",
		"description": "Adds a new river connecting the Dwarf Cave area to Melmond, Earth Cave, and Titan's Tunnel. This allows access to the Melmond region without the CANAL, and also without the SHIP if \"Early Open Progression\" is enabled."
	},
	{
		"Id": "highwayToOrdealsCheckBox",
		"title": "Highway to Ordeals",
		"screenshot": "MapHighwayToOrdeals.gif",
		"description": "Adds a passageway connecting the Lefein area to the Mirage Desert, and a passageway from the Mirage Desert to the Castle of Ordeals.\nRequires other Map Edit flags to be relevant, such as \"Bridge to Lefein\" or \"Northern Docks\"."
	},
	{
		"Id": "gaiaMountainPassCheckBox",
		"title": "Gaia Mountain Pass",
		"screenshot": "gaiaMountainPass.png",
		"description": "Adds a mountain pass to Gaia, making it accessible without the AIRSHIP if either \"Bridge to Lefein\" or \"Lefein River Dock\" is enabled."
	},

	{
		"Id": "earlyKingCheckBox",
		"title": "Early King Item",
		"screenshot": "earlyKingCheckBox.png",
		"description": "The King of Coneria will give the party his item before the Princess is saved."
	},
	{
		"Id": "earlySardaCheckBox",
		"title": "Early Sarda Item",
		"screenshot": "earlySardaCheckBox.png",
		"description": "Sarda will give the party his item before the Vampire is killed."
	},
	{
		"Id": "earlySageCheckBox",
		"title": "Early Sage Item",
		"screenshot": "earlySageCheckBox.png",
		"description": "The Sage in Crescent Lake will give his item without requiring the Earth Orb to be lit."
	},
	{
		"Id": "earlyOrdealsCheckBox",
		"title": "Early Ordeals",
		"screenshot": "earlyOrdealsCheckBox.png",
		"description": "The party may complete the Castle of Ordeals without the CROWN."
	},

	{
		"Id": "zozoMelmondCheckBox",
		"title": "Zozo Melmond",
		"screenshot": "zozoMelmondCheckBox.gif",
		"description": "Includes random battles on the desert tiles inside the town of Melmond, reminiscent of the town of Zozo in Final Fantasy VI.\nIf \"Vampire Attacks Random Town\" is turned on, the desert tiles in whatever town the Vampire has singled out for destruction will have potential encounters. Enemies are pulled from the surrounding area for these vampire-attacked towns."
	},
	{
		"Id": "melmondClinicCheckBox",
		"title": "Melmondish Hospitality",
		"screenshot": "melmondClinicCheckBox.png",
		"description": "Adds a clinic to Melmond.\nIf \"Tavern Recruitment Mode\" is enabled, Melmond's Clinic will be a Pub instead (based on Crecent Lake's Pub).\nThis flag works independent of \"Vampire Attacks Random Town\" such that a new clinic will not be added to other vampire-attacked towns. Meanwhile, if Melmond is \"restored\" because the vampire went elsewhere, there will only be one clinic, not two."
	},
	{
		"Id": "confusedOldMenCheckBox",
		"title": "Confused Old Men",
		"screenshot": "confusedOldMenCheckBox.png",
		"description": "The circle of sages in Crescent Lake is no longer a circle but, instead, each of the sages will walk around, freed of the shackles that kept them stuck in a circle. Viva la resistance!"
	},
	{
		"Id": "gaiaShortcutCheckBox",
		"title": "Add Gaia Shortcut",
		"screenshot": "gaiaShortcut.png",
		"description": "Adds a shortcut in Gaia that connects the L8 Magic Shops, Fairy Spring, and Front Entrance."
	},
	{
		"Id": "moveGaiaItemShopCheckBox",
		"title": "Move Gaia Item Shop",
		"screenshot": "gaiaShortcutMoveItemShop.png",
		"description": "Moves the Item Shop next to the Gaia Shortcut.\nThis flag is ignored if \"Add Gaia Shortcut\" is disabled."
	},
	{
		"Id": "lefeinShopsCheckBox",
		"title": "Lefeinish Hospitality",
		"screenshot": "lefeinShopsCheckBox.png",
		"description": "Lefein now includes an Inn and Clinic, buildings not normally found in that town.\nIf \"Tavern Recruitment Mode\" is enabled, Lefein's Clinic will be a Pub instead."
	},
	{
		"Id": "lefeinSuperStoreCheckBox",
		"title": "Add Lefein SuperStore",
		"screenshot": "lefeinSuperStore.gif",
		"description": "Upgrades the L8 Magic Shops in Lefein to include additional L1-L8 Magic Shops from around the world.\nDoes not include L7 and L8 Magic Shops from the neighboring town of Gaia.\nNote: This flag is ignored if the \"Shop Reduction\" flag for the Magic Shops is enabled."
	},
	{
		"Id": "shufflePravokaShopsCheckBox",
		"title": "Shuffle Pravoka's Shop",
		"screenshot": "shufflePravokaShopsCheckBox.png",
		"description": "Shops in Pravoka are shuffled amongst all occupied and unoccupied buildings."
	},
	{
		"Id": "randomVampAttackCheckBox",
		"title": "Vampire Attacks Random Town",
		"screenshot": "vampAttack.png",
		"description": "Causes the Vampire to attack a random town. The attacked town will not have an Item Shop or Clinic.\nNote: The Vampire will not attack the starting town, Coneria, by default."
	},
	{
		"Id": "randomVampAttackIncludesConeriaCheckBox",
		"title": "Vampire Attacks Random Town - Include Coneria",
		"screenshot": "vampAttackIncludesConeria.png",
		"description": "Allows the Vampire to potentially attack Coneria."
	},

	{
		"Id": "treasuresCheckBox",
		"title": "Treasures",
		"screenshot": "treasuresCheckBox.png",
		"description": "Shuffle all treasures normally available to a random chest. All items are assured to be in a chest somewhere in the game."
	},
	{
		"Id": "randomLootCheckBox",
		"title": "Randomize Treasures",
		"screenshot": "randomLootCheckBox.png",
		"description": "Randomizes the contents of each chest. Items not normally found in vanilla chests may be available, some items may not be found in chests that normally would be, and duplicates may exist.\n\nNone: Chests' content isn't randomized, only shuffled.\nRandomized: Chests' content is randomized based on the quality tier of each item. When selected, you will also be able to customize how good the overall treasure pool is.\nDeep Dungeon: Chests' content is randomized based on each chest's location. Designed for the \"Deep Dungeon\" Game Mode, but also works with other world types: treasure value is based on vanilla dungeon progression in that case.\nRandom: One of the previous options is selected at random."
	},
	{
		"Id": "worldWealthDropDown",
		"title": "Random Wealth",
		"screenshot": "worldWealthDropDown.gif",
		"description": "Alters the distribution of items:\n\"Vanilla Wealth\" is the same number of each tier of item as is present in the vanilla item pool.\n\"High Wealth\" removes some gold chests for more legendary and rare equipment.\n\"Melmond Wealth\" has the lowest chance of top tier gear."
	},
	{
		"Id": "deepDungeonItemModeDropDown",
		"title": "Deep Dungeon Mode",
		"screenshot": "ddDistributeEvenly.gif",
		"description": "Sets how randomized items are placed using the Deep Dungeon treasures randomizer.\n\nProgressive: Treasures get progressively better as you progress.\nChaotic: The quality of the treasures are totally random, wherever the chests are."
	},
	{
		"Id": "betterTrapTreasureCheckBox",
		"title": "Better Trap Treasure",
		"screenshot": "betterTrapTreasureCheckBox.png",
		"description": "Adjusts treasure chests that require walking over an encounter tile so that they are more likely to have high-tier treasures."
	},
	{
		"Id": "earlierRubyCheckBox",
		"title": "Earlier Ruby",
		"screenshot": "earlierRubyCheckBox.png",
		"description": "Adjust the RUBY's placement to earlier in the seed to increase the likelihood that negotiating the Titan's Tunnel is required for progression."
	},
	{
		"Id": "npcItemsCheckBox",
		"title": "Main NPC Items",
		"screenshot": "npcItemsCheckBox.png",
		"description": "Adds the BRIDGE, LUTE, SHIP, ROD, CANOE, CUBE, and BOTTLE to the Key Item shuffle."
	},
	{
		"Id": "npcFetchItemsCheckBox",
		"title": "Fetch Quest Rewards",
		"screenshot": "npcFetchItemsCheckBox.png",
		"description": "Randomizes the rewards from the fetch quest items. These are the CROWN, CYRSTAL, HERB, TNT, ADAMANT, BOTTLE, and the Lefein item from the SLAB. If left unchecked, each fetch quest is vanilla (i.e., CROWN would lead to CRYSTAL, CRYSTAL would lead to HERB, etc.)."
	},
	{
		"Id": "shuffleObjectiveNPCsCheckBox",
		"title": "Objective NPCs",
		"screenshot": "shuffleObjectiveNPCsCheckBox.png",
		"description": "Shuffles the locations of Dr. Unne, the Elven Doctor, and Bahamut.\nNote that the Prince will still be napping in Elfland once you deliver the HERB to the Elven Doctor and you will still need to talk to the Prince after.\nAlso, the small pool of shuffled NPCs means the NPCs may retain their normal location."
	},

	{
		"Id": "tcFormationPoolDropDown",
		"title": "Trapped Chests Formations",
		"screenshot": "tcFormations.png",
		"description": "Selects what formations are inside trapped chests.\n\n Allocated Formations: All alternate formations (116) are allocated to a random chest. If there's still trapped chests without a formation, a new batch of alternate formations is distributed.\n\n Random Formations: An alternate formation is randomly selected for each chest, without regard to frequency of a given formation.\n\n Local Formations: An alternate formation of the local encounter table is selected at random for each trapped chest.\n\n Vanilla Spikes: A random vanilla spike formation from the current dungeon is selected for each trapped chest.\n\n Random Fiends: Chests are guarded by a random Fiend.\n\n Phantom: Chests are guarded by Phantom.\n\n Random: Select one of the previous options randomly."
	},
	{
		"Id": "tcChestCountSlider",
		"title": "Trapped Chests Count",
		"screenshot": "tcChestsPool.png",
		"description": "Sets the number of chests that will have traps (monsters) in them. Setting the slider to the rightmost position will select a random number of trapped chests.\n\nIn game count may slightly differ for some flags combinations.\nFor best results, use in combination with the sub-flags included in this section."
	},
	{
		"Id": "tcBetterTreasuresDropDown",
		"title": "Rare Treasures",
		"screenshot": "tcBestTreasures.png",
		"description": "Sets whether or not chests containing Rare and Legendary items can be in Trapped Chests:\n\nNever: Rare and Legendary items are never trapped.\n\nRandom: Rare and Legendary items may be trapped.\n\nAlways: All chests containing Legendary or Rare gears are trapped."
	},
	{
		"Id": "tcKeyItemsDropDown",
		"title": "Key Items",
		"screenshot": "tcKeyItems.png",
		"description": "Sets whether or not chests containing Key Items can be in Trapped Chests:\n\nNever: Key Items are never trapped.\n\nRandom: Key Items may be trapped.\n\nAlways: All chests containing Key Items are trapped."
	},
	{
		"Id": "tcShardsDropDown",
		"title": "Shards",
		"screenshot": "trappedShardsCheckBox.gif",
		"description": "Sets whether or not chests containing Shards can be in Trapped Chests:\n\nNever: Shards are never trapped.\n\nRandom: Shards may be trapped.\n\nAlways: All chests containing Shards are trapped."
	},
	{
		"Id": "tcExcludeCommonCheckBox",
		"title": "Exclude Common Treasures",
		"screenshot": "trappedChestsCheckBox.gif",
		"description": "Common treasures (common equipment, consumables and GP chests) are never trapped."
	},
	{
		"Id": "tcProtectIncentivesCheckBox",
		"title": "Exclude Incentivized Items",
		"screenshot": "tcProtectIncentive.png",
		"description": "Chests containing Incentivized Items (including Incentivized Gear) will never be trapped."
	},
	{
		"Id": "trappedMarkCheckBox",
		"title": "Trapped Chests are Marked",
		"screenshot": "TCmarkedChests.png",
		"description": "Puts an X on chests to warn that they're trapped."
	},

	{
		"Id": "freeShipCheckBox",
		"title": "Free Ship",
		"screenshot": "freeShipCheckBox.png",
		"description": "Bikke's SHIP will appear in Coneria's dock at the start of the game."
	},
	{
		"Id": "freeAirshipCheckBox",
		"title": "Free Airship",
		"screenshot": "freeAirshipCheckBox.png",
		"description": "The AIRSHIP rises from the grassy plains in front of Coneria at the start of the game."
	},
	{
		"Id": "freeBridgeCheckBox",
		"title": "Free Bridge",
		"screenshot": "freeBridgeCheckBox.png",
		"description": "The BRIDGE linking Coneria to Pravoka and onward is built when the game begins.\n(Instead, the Bridge will connect the Pravoka area to Lefein if the \"Bridge to Lefein\" flag (Mode & World tab) is active.)"
	},
	{
		"Id": "freeCanalCheckBox",
		"title": "Free Canal",
		"screenshot": "freeCanalCheckBox.png",
		"description": "Nerrick's CANAL is already excavated when the game begins."
	},
	{
		"Id": "freeCanoeCheckBox",
		"title": "Free Canoe",
		"screenshot": "freeCanoeCheckBox.gif",
		"description": "Begin the game well equipped for a proper arm workout as the CANOE will aleady be in your inventory."
	},
	{
		"Id": "FreeLute",
		"title": "Free Lute",
		"screenshot": "chaosRushCheckBox.png",
		"description": "Starts the game with the LUTE already in the party's inventory so they can begin their musical adventure. No bards were harmed in the making of this flag."
	},
	{
		"Id": "FreeTail",
		"title": "Free Tail",
		"screenshot": "FreeTail.png",
		"description": "The rat's TAIL, required for promotion, is in your inventory when the game begins. You may want to wash the bag after use."
	},

	{
		"Id": "NoTailCheckBox",
		"title": "Remove Tail",
		"screenshot": "NoTailCheckBox.png",
		"description": "Remove the rat TAIL from the game. Bahamut is no longer interested in that mummified bit of rodent.\nIf the \"Fight Bahamut\" flag is on, removing the TAIL will not prevent class change; it actually makes it easier. By removing the TAIL the only requirement for class change will be fighting Bahamut, no TAIL required."
	},
	{
		"Id": "NoMasamuneCheckBox",
		"title": "Remove Masamune",
		"screenshot": "NoMasamuneCheckBox.gif",
		"description": "Removes the legendary sword, the Masamune, from chests, from shops (if elite gear is turned on), and from incentive locations (if the Masamune is incentivized)."
	},
	{
		"Id": "NoXcalberCheckBox",
		"title": "Remove Xcalber",
		"screenshot": "NoXcalberCheckBox.png",
		"description": "Removes the Xcalber from chests, from shops (if elite gear is turned on), and from the ADAMANT turn in (if fetch quests are vanilla)."
	},
	{
		"Id": "noFloaterCheckBox",
		"title": "Remove Floater",
		"screenshot": "noFloater.png",
		"description": "Removes the Floater from the game, making it impossible to get the Airship.\n\nCan only be enabled if Nothern Docks is enabled.\n\nEnable Bahamut Cardia dock, Lefein river dock, and Gaia mountain pass map edits to make those areas accessible by Ship."
	},

	{
		"Id": "GuaranteedMasamuneCheckBox",
		"title": "Guaranteed Endgame Masamune",
		"screenshot": "guaranteedMasamuneCheckBox.png",
		"description": "Guarantees the contents of the vanilla Masamune chest (the bottom-right chest on the Air Floor in ToFR, the same floor you re-fight Tiamat on) will be a Masamune.\nThis flag does not change the placement of other Masamune(s)."
	},
	{
		"Id": "SendMasamuneHomeCheckBox",
		"title": "Send Masamune Home",
		"screenshot": "guaranteedMasamuneCheckBox.png",
		"description": "Guarantees the contents of the vanilla Masamune chest will be a Masamune AND prevents placement of other Masamune(s) if \"Randomize Treasures\" is activated.\n This flag is ignored if there is an Incentive Masamune. This flag will not remove Masamunes found in Shops."
	},
	{
		"Id": "masaGuardianCheckBox",
		"title": "WarMech, Guardian of Masamune",
		"screenshot": "masaGuardianCheckBox.gif",
		"description": "Any chest containing a Masamune is protected by a forced WarMech encounter."
	},



	{
		"Id": "shopsCheckBox",
		"title": "Shop Shuffle",
		"screenshot": "shopsCheckBox.png",
		"description": "Shuffles the contents of Weapon, Armor, and Item shops, changing which shops have what items for sale. PURE and SOFT potions will be available in the Coneria Item Shop under most flagsets (any flags that make it likely you'll face these statuses early, such as Randomized Status Attacks).\n Note that this only shuffles the contents of each shop among like shops around the world -- weapons for weapons, armor for armor, and items among other items. You won't, for instance, find HEAL pots in a Weapon shop or a Silver Bracelet in an Item shop."
	},
	{
		"Id": "randomWaresCheckBox",
		"title": "Random Weapons and Armor",
		"screenshot": "randomWaresCheckBox.png",
		"description": "Adds various low to mid-tier Weapons and Armor found in the game to the Weapon and Armor Shops (respectively) regardless of whether they are normally sold in shops or found in chests."
	},
	{
		"Id": "randomWaresIncludesCheckBox",
		"title": "Include Caster and Elite Gear",
		"screenshot": "randomWaresIncludesCheckBox.png",
		"description": "Adds rare and high level Weapons and Armor found in the game to Weapon and Armor Shops (respectively). These can include normally unique or high-value items such as the Masamune and Ribbons as well as equipment that casts spells when used, such as Black Shirts and Thor Hammers."
	},
	{
		"Id": "magicShopsCheckBox",
		"title": "Magic Shop Shuffle",
		"screenshot": "magicShopsCheckBox.png",
		"description": "Shuffles what level spells are available at in each shop. With this checked you will likely find several different levels of magic at each shop regardless of location.\n In essence, this is a flag that will likely make the start of the game harder as, even at Coneria, you could end up with spells from higher levels all mixed together (as shown in the tooltip image). This could potentially block characters from using magic (or even being able to afford it) until much later in the game."
	},
	{
		"Id": "magicShopLocsCheckBox",
		"title": "Magic Shop Location Shuffle",
		"screenshot": "magicShopLocsCheckBox.gif",
		"description": "Shuffles the locations of magic shops, except Coneria (Level 1 magic), so that any town's magic shop could show up anywhere else (i.e., Pravoka's magic shop could be in Melmond).\n Note: Magic shops are not coupled together, so if you use this flag you could end up with a Level 3 Black Magic Shop and a Level 6 White Magic Shop at Pravoka, or four different levels of shops at Elfland."
	},
	{
		"Id": "magicShopLocationPairsCheckBox",
		"title": "Paired Shuffle",
		"screenshot": "magicShopLocationPairsCheckBox.gif",
		"description": "When shuffling the locations of magic shops, they are moved in pairs so spells of a certain level are found together (i.e., both Level 6 Magic shops could move to Pravoka, or both Level 2 and both Level 7 could move to Elfland)."
	},

	{
		"Id": "legendaryShopsGroup",
		"title": "Legendary Shops",
		"screenshot": "legendaryShopsGroup.gif",
		"description": "Creates up to five legendary shops in dungeons, one of each type. Shops will tend to have high-tier gear (which will often include things you cannot normally find in shops) or highly desirable spells.\nThe potential locations are: Earth Cave B2, Marsh Cave B2, Dwarves' Cave, Mirage Tower F1, Ice Cave B1, & Left Sea Shrine 2.\n\"Exclusive\" means that it will also remove any items/spells found in the Legendary Shop from all other shops and treasure chests in the world."
	},
	{
		"Id": "legendaryWeaponShopCheckBox",
		"title": "Legendary Weapon Shop",
		"screenshot": null,
		"description": "Randomly selects 3 Legendary or stronger Rare weapons, but does not include Masamune. (Examples: Katana, Coral Sword, Mage Staff.)"
	},
	{
		"Id": "legendaryArmorShopCheckBox",
		"title": "Legendary Armor Shop",
		"screenshot": null,
		"description": "Randomly selects 5 Legendary or Rare pieces of armor. (Examples: Ribbon, Opal set, Wizard shirts.)"
	},
	{
		"Id": "legendaryBlackShopCheckBox",
		"title": "Legendary Black Magic Shop",
		"screenshot": null,
		"description": "Randomly selects 5 strong spells. Compatible with Spell Crafter.\nThe pool for vanilla spells is: FIR2, LIT2, ICE2, FIR3, LIT3, ICE3, NUKE, BRAK, BANE, QAKE, ZAP!, XXXX, LOCK, LOK2, TMPR, SABR, FAST, WARP. If \"LOCK & LOK2 Mode\" is only set to Vanilla or 107 Accuracy, LOCK & LOK2 are removed from the pool."
	},
	{
		"Id": "legendaryWhiteShopCheckBox",
		"title": "Legendary White Magic Shop",
		"screenshot": null,
		"description": "Randomly selects 4 strong spells. Compatible with Spell Crafter.\nThe pool for vanilla spells is: CUR3, CUR4, HEL2, HEL3, LIFE, LIF2, HRM3, HRM4, FADE, RUSE, INVS, INV2, EXIT, WALL, XFER. When Exclusive Legendary White Magic Shops and Exclusive Legendary Item Shops are both present, PURE and SOFT are added to the pool."
	},
	{
		"Id": "legendaryItemShopCheckBox",
		"title": "Legendary Item Shop",
		"screenshot": null,
		"description": "Always sells either Cabins or Houses, and also sells two additional non-Shelter items (Heals, Pures, or Softs). It will never be selling the Shop Key Item.\nIf New Consumables are active (Gear & Items tab) and \"Legendary Shops\" is selected, then the shop will sell Cabins or Houses, 1-2 new consumables, and 0-1 other non-Shelter items."
	},

	{
		"Id": "magicLevelsCheckBox",
		"title": "Magic Levels",
		"screenshot": "magicLevelsCheckBox.png",
		"description": "Shuffles the levels of spells, but not what level is sold, at each magic shop.\nUnless \"Keep Permissions\" is checked, the ability of a character to learn a given spell depends on whether or not a class can learn the spell originally in that spell's new slot. You can reference the \"Spell Permissions Guide\" linked in the Guides & Mechanics section of the Wiki for a spell slot breakdown."
	},
	{
		"Id": "magicLevelsTieredCheckBox",
		"title": "Tiered Shuffle",
		"screenshot": "magicLevelsTieredCheckBox.png",
		"description": "Shuffles the magic across spell levels, but with a weight given to certain spells at certain levels.\nYou are more likely to find levels 1 through 3 magic in the levels 1 through 3 stores, with those spells given a 60% chance to show up there (versus 30% for levels 4 through 6 and 10% for levels 7 and 8).\nAt levels 4 through 6, those spells are 40% likely to show up (versus 30% for levels 1 through 3, and 30% for 7 and 8).\nFinally, for levels 7 and 8 shop, those levels are 60% likely to show up in the shops (versus 10% for levels 1 through 3, and 30% for levels 4 through 6)."
	},
	{
		"Id": "magicLevelsMixed",
		"title": "Mix Spellbooks",
		"screenshot": "magicLevelsMixed.png",
		"description": "Mixes the standard White and Black spellbooks together, allowing for White Magic to show up in Black Magic shops (and be usable by Black Mages/Wizards) and vice versa for Black Magic and White Shops/Casters."
	},
	{
		"Id": "magicPermissionsCheckBox",
		"title": "Keep Permissions",
		"screenshot": "magicPermissionsCheckBox.png",
		"description": "Forces spells to keep the class permissions from the unrandomized game, no matter what slot they are in or level of magic they are currently listed at. Thus, with \"Keep Permissions\" on, even if NUKE shows up at level one, your Black Mage wouldn't be able to learn the spell until after promotion (as the spell was promotion locked, at Level 8, in the vanilla game)."
	},

	{
		"Id": "cureHealBuffCheckBox",
		"title": "Improve Curative Spells",
		"screenshot": "cureHealBuffCheckBox.png",
		"description": "Improves the efficacy of CURE, CUR2, CUR3, HEAL, HEL2, HEL3, LAMP, and AMUT spells. CURE spells now restore twice as much health and HEAL spells restore 33% more. LAMP and AMUT now also cure paralysis effects."
	},
	{
		"Id": "tier1DamageBuff",
		"title": "Improve Tier-1 Damage Spells",
		"screenshot": null,
		"description": "Makes HARM single-target, and improves the efficacy of the FIRE, ICE, LIT, and HARM spells to have equivalent power to their Tier-3 counterparts (e.g. HARM now does as much damage as HRM3, but to a single target)."
	},
	{
		"Id": "LockMode",
		"title": "Set Lock Hit Mode",
		"screenshot": "LockMode.png",
		"description": "Allows control over the chance to hit when casting LOCK and LOK2 spells. Vanilla is about a 7% chance to hit vs Chaos; 107 is about 28%; 162 is about 56%. Auto-hit will always hit (100%)."
	},
	{
		"Id": "magicAutohitThresholdDropDown",
		"title": "Power Word HP Limit",
		"screenshot": "magicAutohitThresholdDropDown.gif",
		"description": "Changes the threshold at which BLND, STUN, and XXXX are effective, both against enemies and the heroes.\nThe value, as selected in the dropdown, will always be a multiple of 300, or unlimited, but you can set it to randomly select, before the ROM is generated, which option will be used in the game."
	},

	{
		"Id": "generateNewSpellbook",
		"title": "Generate New Spellbooks (Spellcrafter)",
		"screenshot": "generateNewSpellbook.png",
		"description": "Randomly generates completely new white and black magic spell books, replacing all magic in the game with this new selection of spells. Some spells may have the same names (i.e., FIRE, ICE, WARP, TMPR) while others will be completely new spells not seen before in the vanilla version of Final Fantasy (i.e., ROCK, SNOW, VOLT, etc.).\n Note: Spellcrafter will also change the default slots characters can learn spells, in effect reducing the number of spells, and spell slots, the Knight, Ninja, and Red Mage can learn.\nCheck the Spellcraft FAQ on the Wiki (under Randomizer Documentation) for more detailed information."
	},
	{
		"Id": "spellcrafterRetainPermissions",
		"title": "Retain Old Permissions (Spellcrafter)",
		"screenshot": "spellcrafterRetainPermissions.png",
		"description": "When enabled, Spellcrafter will not overwrite the game's original spell permissions, so characters will learn the spells in their default, vanilla slots, even with Spellcrafter enabled (i.e., Red Mages will learn the first and third slot in Level 1 White Magic and Level 3 Magic, all White Magic at Level 2, everything in the first four levels of Black Magic, etc.)."
	},
	{
		"Id": "spellcrafterMixSpells",
		"title": "Mix Spellbooks (Spellcrafter)",
		"screenshot": "spellcrafterMixSpells.png",
		"description": "Mixes the randomly generated spells created by Spellcrafter. Spells that would typically be considered White Magic may be classed as Black Magic and vice-versa, allowing those casters a greater variety of spells, potentially."
	},

	{
		"Id": "spellNameMadness",
		"title": "Spell Name Obfuscation",
		"screenshot": "spellNameMadness.png",
		"description": "Hides the actual spell names for all spells:\n\nMixed Up: Shuffles spell names.\n\nMadness: Creates random codewords."
	},

	{
		"Id": "shopReductionTable",
		"title": "Shop Reduction",
		"screenshot": "shopReductionTable.png",
		"description": "Reduces the number of Items/Magic sold in Shops, or removes Shops entirely. Numbers are rounded, so e.g. when using Spread w/ 60% Reduction, a shop that'd otherwise sell 4 items will sell 2, and a shop that'd sell 1 item would be closed.  Modes:\nNone - Do not remove anything.\nWhole Shops - Removes the specified amount of shops as a whole.\nAll Items of a Kind - Selects the specified amount of distinct Items and removes all instances of them (e.g. all Heals).\nSpread - Applies the reduction for each shop individually (e.g. each shop has 40% fewer items for sale).\nUnequal - Removes the amount from all entries combined (e.g. some shops will be full, some might be half full, some might be removed).\nRandom - Any of the other options at random.\n(Created \"Legendary Shops\" are unaffected and will not be reduced.)"
	},
	{
		"Id": "formationShuffleModeDropDown",
		"title": "Enemy Formation Shuffle Mode",
		"screenshot": "formationShuffleModeDropDown.gif",
		"description": "Shuffles the encounters that appear in enemy domains.\nVanilla: Enemy groups remain as they exist in the original game. This allows players to predict encounters in a dungeon if they know the vanilla values.\n Shuffle Rarity: Enemy groups are shuffled within a zone, so that Group 1 (common) fights can appear as Group 6 (uncommon), etc. This removes the ability to 'scout' the encounter table and know which fights will appear in advance.\nTiered Rarity Shuffle: Enemy formations will shuffle within their encounter groups based on their original rarity. (1-4 will tend to be lower in rarity, 5-6 can sometimes be lower in rarity, 7-8 will rarely be lower in rarity.)\nShuffle Across Zones: Shuffles ALL encounters, so that any encounter can appear anywhere regardless of zone or rarity. The overworld between Coneria and ToF is still guaranteed to have earlier enemies (e.g. BONE, WOLF, GrIMP).\n Totally Random: Populates the encounter table entirely at random (excepting fiends, plot-triggered encounters, and empty encounters). This means specific formations can be added multiple times, and that \"B-side\" formations that aren't used in vanilla can appear as well. The overworld between Coneria and ToF is still guaranteed to have earlier enemies (e.g. BONE, WOLF, GrIMP).\n Note: This feature is disabled when generating new enemy formations (via Enemizer)."
	},
	{
		"Id": "runnabilityShuffleCheckbox",
		"title": "Unrunnable Formation Shuffle & Quantity",
		"screenshot": "enemyFormationsUnrunnableCheckBox.png",
		"description": "When unchecked, the same formations that are unrunnable in the vanilla game will remain unrunnable. Otherwise, which formations you can run from will be shuffled. Bosses (Fiends & Chaos) and Minibosses (Astos, Pirates, Vampire, & Garland) will always be unrunnable.\nAdjust the slider to select what percentage of non-boss fights will be unrunnable (vanilla is 12%). If a range is selected, a random percentage within that range will be chosen when the seed is generated."
	},
	{
		"Id": "unrunnablesStrikeFirstAndSurpriseCheckBox",
		"title": "First Strike and Surprise Possible when Unrunnable",
		"screenshot": "unrunnablesStrikeFirstAndSupriseCheckBox.png",
		"description": "Allows you to first strike an unrunnable formation, or an unrunnable formation to ambush you."
	},
	{
		"Id": "enemyFormationsSurpriseCheckBox",
		"title": "Enemy Surprise Bonus",
		"screenshot": "enemyFormationsSurpriseCheckBox.png",
		"description": "Shuffles the surprise bonus for enemy formations, changing which groups will (almost) always ambush you."
	},
	{
		"Id": "bossScriptsCheckBox",
		"title": "Boss Scripts",
		"screenshot": "shuffleBossesScripts.png",
		"description": "Shuffles the spells and skills (if any) each bosses uses. The original Fiends are shuffled between themselves, then the second Fiends, WarMech and Chaos."
	},
	{
		"Id": "bossSkillsSpellsCheckBox",
		"title": "Boss Skills/Spells",
		"screenshot": "onlyShuffleBossSkillsCheckBox.png",
		"description": "Shuffles bosses' skills and spells so they can appear in any script. The original Fiends are shuffled between themselves, then the second Fiends, WarMech and Chaos."
	},

	{
		"Id": "enemyScriptsCheckBox",
		"title": "Enemy Scripts",
		"screenshot": "enemyScriptsCheckBox.png",
		"description": "Shuffles the spells and skills (if any) each monster uses, allowing any enemy to have any other's combat logic."
	},
	{
		"Id": "enemySkillsSpellsCheckBox",
		"title": "Enemy Skills/Spells",
		"screenshot": "enemySkillsSpellsCheckBox.png",
		"description": "Shuffles non-boss enemy skills and spells so they can appear in any script.\nNote: This can result in some of the scripts ending up empty, so only about 80% as many enemies will have scripts compared to them not being shuffled (so ~24% of enemies with a Vanilla Script Count instead of ~30%). Enable \"No Empty Scripts\" to spread active scripts back out."
	},
	{
		"Id": "enemySkillsSpellsTieredCheckBox",
		"title": "Generate Balanced Scripts",
		"screenshot": "enemySkillsSpellsTieredCheckBox.png",
		"description": "Balances skill shuffles among the non-boss enemies so that earlier enemies will only have potential access to earlier skills while later enemies are more likely to get the later, more dangerous, skills.\nBalanced enemy spells will be selected from ALL spells, not just the spells normally in the enemy pool."
	},
	{
		"Id": "touchMode",
		"title": "Status Attacks Mode",
		"screenshot": "enemyStatusAttacksCheckBox.png",
		"description": "Sets the status ailments each enemy can inflict when they use physical attacks.\nVanilla: Enemies keep their standard touch attack.\nShuffle: Shuffle the standard vanilla touch attacks amongst all enemies. (This includes exactly 1 Death touch and 1 Stone touch.)\nRandomize: Assign randomly selected touch attacks to enemies. (See the Pool tooltip for further breakdowns.)\nRandom: Select one of the previous options at random."
	},
	{
		"Id": "touchPool",
		"title": "Status Attacks Pool",
		"screenshot": "disableStunTouchCheckBox.png",
		"description": "Sets what status ailment can be inflicted when randomizing status attacks.\nAll: All possible status - Death, Stone, Mute, Poison, Dark, Stun, and Sleep. (There's a ~9% chance for Death or Stone, and a ~91% chance for one of the other effects for both \"All\" Pools.)\nAll except Stun Status: All possible status, except Stun.\nBalanced Rude: Emphasizes nastier effects somewhat more: ~15% chance for Death or Stone, ~8% chance for Stun, reduced chance for Dark (unless \"Increase Dark Penalty\" is on), increased chance for Mute.\nOnly Death Status: Only the Death ailment can be assigned.\nRandom: Select one of the previous options at random."
	},
	{
		"Id": "touchIncludeBosses",
		"title": "Include Bosses",
		"screenshot": "everythingHasDeathTouchExcludeFiendsCheckbox.png",
		"description": "Bosses are included when shuffling/randomizing status attacks. Bosses are the Fiends, WarMech and Chaos."
	},
	{
		"Id": "EnemyTrapTiles",
		"title": "Trap Tiles",
		"screenshot": "enemyTrapTilesCheckBox.gif",
		"description": "Vanilla: All tiles are their original monster formations.\n\nShuffle: Shuffles all the forced encounter tiles in the game, except the Fiend refights. This doesn't add in any new tiles, instead it simply shuffles the existing encounter tiles among themselves.\n\nA-Side Formations: Trap Tiles are randomly populated from the A-side encounter list.\n\nB-Side Formations: Trap tiles are randomly populated from the B-side encounter list.\n\nA-Side & B-Side: Trap tiles are randomly populated from any of the A-side or B-side encounter formations.\n\nRemove Trap Tiles: Removes all the forced encounter tiles from the game, except the Fiend refights.\n\nLocal Formations: Tiles will use formations from the same dungeon that they appear in (when possible).\n\nCurated: \"A-Side & B-Side\" but with overly punishing encounters removed. To make up for this, the best grind tiles have also been removed. (This is a sample pool. Tournament organizers can request specific enemy formations to be used, contact your local dev for details.)\n\n(None of the randomized pools include bosses.)"
	},
	{
		"Id": "WarMECHModeDropDown",
		"title": "WarMECH Mode",
		"screenshot": "WarMECHModeDropDown.png",
		"description": "Changes the way WarMECH can be found, and interacted with, in the game.\n Vanilla: WarMECH may appear on Sky Castle 5F, as in the original game.\n Patrolling: A WarMECH sprite will appear wandering on Sky Castle 4F (the floor before the Tiamat-1 fight). Talking to WarMECH starts an unrunnable battle.\n Required: A WarMECH sprite will guard Tiamat's room. You must defeat it before you can fight the actual boss. If WarMECH is Required or Patrolling, it will not appear anywhere else.\n Unleashed: WarMECH appears as a Group 7 formation (3/64 encounters) in ALL zones, including the overworld.\nAll: WarMech will be Patrolling, Required, AND Unleashed.\nRandom: Chooses randomly from the above options, but is weighted to make Vanilla, Unleashed, and All less likely than Patrolling or Required."
	},
	{
		"Id": "swolePiratesCheckBox",
		"title": "Buff the Pirates",
		"screenshot": "swolePiratesCheckBox.png",
		"description": "Increases the stats of Bikke's pirates considerably, roughly equivalent to a level 6 Fighter with a cheap but decent sword and iron armor (or a Catman with more absorb and less magic defense), and increases the XP and gold yield from them by a factor of 20.\nThis is done before stat randomization (in the Scale tab), and also increases the level of scripts they can carry when using both the \"Generate Balanced Scripts\" and \"Pirates - Unsafe Script\" flags."
	},
	{
		"Id": "allowUnsafePiratesCheckBox",
		"title": "Unsafe Pirates",
		"screenshot": "allowUnsafePiratesCheckBox.png",
		"description": "Allows Pirates to use shuffled skills and spells and received a status attack. Left unchecked, Pirates will always have a script that directs them to only attack and will never cause a status ailment on attack."
	},
	{
		"Id": "shuffleAstosCheckBox",
		"title": "Shuffle Astos",
		"screenshot": "shuffleAstosCheckBox.png",
		"description": "Astos is disguised as a quest NPC: Bahamut, Canoe Sage, CubeBot, Elf Doctor, Elf Prince, Fairy, Lefein, Matoya, Nerrick, Sarda, Smith, Titan, Unne or the kindly old king from Northwest Castle.\nUnless he is picked by Astos shuffle, the kindly old king in the Northwest Castle will not fight you."
	},
	{
		"Id": "fiendShuffleCheckBox",
		"title": "Shuffle the Original Fiend Fights",
		"screenshot": "fiendShuffleCheckBox.gif",
		"description": "Shuffles which Fiend is guarding which orb in the present day. For example, the Fiend at the bottom of Earth Cave could be Tiamat."
	},
	{
		"Id": "alternateFiendsCheckBox",
		"title": "Alternate Fiends",
		"screenshot": "AlternateFiends.png",
		"description": "Replace all four Fiends with new Fiends, from a pool of about 20, each with their own weaknesses and skill/spell lists.\nNote that the new Alternate Fiend spells & skills will still be shuffled unless \"Shuffle Scripts\" and \"Shuffle Skills & Spells\" are turned off for Bosses.\nSee also: \"Alternate Final Boss\", under the Goal tab."
	},

	{
		"Id": "fightBahamutCheckBox",
		"title": "Fight Bahamut",
		"screenshot": "fightBahamutCheckBox.gif",
		"description": "Turning in the TAIL is not the only requirement for class change; you must also defeat Bahamut to prove your courage. Also makes Bahamut's dragon minions hostile.\nIf \"Remove Tail\" is enabled, the only requirement for class change is to defeat Bahamut.\nNote: This flag is ignored when \"Enemizer\" or \"Lich's Revenge\" is enabled."
	},
	{
		"Id": "swoleBahamutCheckBox",
		"title": "Fight Bahamut - Buffed Bahamut",
		"screenshot": "buffedBahamutCheckBox.png",
		"description": "Increases the stats of Bahamut, roughly to the equivalent of Tiamat. Buffed Bahamut will often be given skills, increased critical hit rate, and/or increased number of hits.\nAlso grants a larger XP yield, roughly half that of WarMECH.\n(Buffed Bahamut's skills, if present, will stay in place regardless of other Script Shuffle settings.)"
	},

	{
		"Id": "spoilerBatsDropDown",
		"title": "Temple of Fiends Bats Text",
		"screenshot": "spoilerBats.png",
		"description": "The dialogue for the Sky Warrior bats in Garland's room can be replaced with spoilers about Chaos and the Fiend refights that will appear in the Temple of Fiends Revisited.\nVanilla - Bats have story dialogue after all four Orbs are lit, as in the vanilla game.\nHints - Describes the ToFR boss stats using text. Adjectives used represent increasing order of difficulty: pretty, extra, very, super, incredibly, insanely.\nStars - Rates each ToFR boss stat on a scale of 1-10.\nFull Stats - Gives the numerical stats and full spell and skill scripts for each ToFR boss."
	},
	{
		"Id": "spoilerBatsDontCheckOrbsCheckbox",
		"title": "Temple of Fiends Bats Text - Early Spoilers",
		"screenshot": "spoilerBatsEarly.gif",
		"description": "Spoiler information can be obtained from the Sky Warrior bats at any time, without needing to light the four Orbs first."
	},

	{
		"Id": "randomizeFormationEnemizer",
		"title": "Generate New Formations (Enemizer)",
		"screenshot": "randomizeFormationEnemizer.png",
		"description": "When enabled, Enemizer uses the pre-existing monsters in the game and mixes them up, generating entirely new formations of enemies not traditionally seen in the game. On its own it does not create new enemies, just new formations."
	},
	{
		"Id": "randomizeEnemizer",
		"title": "Generate New Enemies (Enemizer)",
		"screenshot": "randomizeEnemizer.png",
		"description": "When enabled, this flag will generate an entirely new set of enemies to populate the entire world. Although the basic sprites will remain the same (as the game has to use the original assets), and they will (generally) retain something of their original names, these will be new enemies with all their appropriate stats scaled to the zone you're exploring. \nAs an example, you could leave Coneria and find level 1 MECHs waiting for you in the forest, G.CRABs lurking on the ocean, or BEASTs out on the plains.\nCheck the Enemizer FAQ on the Wiki (under Randomizer Documentation) for more detailed information."
	},


	{
		"Id": "allowedStartingClassesTooltip",
		"title": "Allowed Starting Classes",
		"screenshot": null,
		"description": "Select which character classes can be chosen at the start of the game, from both regular and promoted classes. The four character slots can be restricted individually, or all together with the \"All\" row.\n\"Forced\" means that slot will be randomly chosen from the selected possibilities and then locked so you cannot change it. \"None\" means that slot can have a blank spot with no light warrior. Forced + None together means if None is randomly selected, that slot will be locked to having no light warrior."
	},
	{
		"Id": "EnablePoolParty",
		"title": "Party Draft",
		"screenshot": "EnablePoolParty.gif",
		"description": "Draft your party from a pool of random characters. The pool is populated with classes from \"Allowed Starting Classes\", with duplicate classes possible. Once a character is selected, it's removed from the pool. Cancelling your choice puts the character back in the pool."
	},
	{
		"Id": "PoolSizeDropDown",
		"title": "Pool Size",
		"screenshot": "PoolSizeDropDown.gif",
		"description": "Allows you to set the total number of characters in the Party Draft pool."
	},
	{
		"Id": "safePoolParty",
		"title": "Safe Party Draft",
		"screenshot": "EnablePoolParty.gif",
		"description": "Guarantee 1 melee class and 2 distinct mage classes in the pool."
	},
	{
		"Id": "tavernMode",
		"title": "Tavern Recruitment Mode",
		"screenshot": "tavernMode.png",
		"description": "Replaces the Clinics found in towns with Pubs. These Pubs allow the party to recruit a Light Warrior of a random class, in addition to the standard Clinic duties of reviving fallen Light Warriors."
	},
	{
		"Id": "tavernModeHireOnly",
		"title": "Disable Reviving at Taverns",
		"screenshot": "tavernModeHireOnly.png",
		"description": "Disables the ability to revive Light Warriors at the Pub.\nWhen enabled, fallen Light Warriors may only be revived with the LIFE or LIF2 spells, or replaced by the class sold by the Pub."
	},
	{
		"Id": "tavernModeReplaceOnlyNone",
		"title": "Only Replace Nones at Taverns",
		"screenshot": "tavernModeReplaceOnlyNone.png",
		"description": "Limit hiring to only replace \"None\" characters. This means once you chose a party member for that spot you are stuck with them."
	},
	{
		"Id": "recruitableAdventurersTooltip",
		"title": "Recruitable Adventurer Classes",
		"screenshot": null,
		"description": "Select the possible classes available to recruit. Applies to both Tavern Recruitement and NPC Recruits."
	},

	{
		"Id": "classAsNpcFiendsCheckBox",
		"title": "Recruits Gated by Fiends",
		"screenshot": "classAsNpcFiendsCheckBox.png",
		"description": "A new character (from a random class) is behind each Fiend. When talked to, that character replaces the selected party member. Push B at the selection screen to cancel taking the gated character."
	},
	{
		"Id": "classAsNpcForcedFiendsCheckBox",
		"title": "Forced Characters",
		"screenshot": "classAsNpcForcedFiendsCheckBox.png",
		"description": "The recruitable character is placed in front of the Elemental Orb altar, forcing the party to pick up the new character before they can officially light the orb."
	},
	{
		"Id": "classAsNpcKeyNpcCheckBox",
		"title": "Recruits Linked to Key NPCs",
		"screenshot": "classAsNpcKeyNpcCheckBox.png",
		"description": "A new character (from a random class) is linked to a key NPC. If that key NPC requirement is fulfilled (e.g., you have given the Fairy the Bottle), you can replace a party member (including a None) with the Recruit.\nThe new Recruit will keep any XP from the replaced party member, but no spells or spell charges. Push B at the selection screen to cancel taking the gated character.\nPossible key NPCs: Princess Sara, Matoya, Bikke, King of the Northwest Castle, Elf Prince, Smith, Nerrick, Dr. Unne, Sarda, Canoe Sage, Fairy, Lefeinish Man.\nNote that the slider for Recruit Count only applies to the Key NPC Recruits; if \"Recruits Gated by Fiends\" is also selected, there will be an additional 4 recruits total. Also, if both flags are selected, one of each class will first be linked to Key NPCs, and then if any are left they will be assigned to Fiends. Any excess Recruits (beyond 6 total) will be purely random classes."
	},
	{
		"Id": "classAsNpcDuplicateCheckBox",
		"title": "Allow Duplicate Recruits",
		"screenshot": "classAsNpcDuplicateCheckBox.png",
		"description": "Normally, Recruits will have unique classes, unless they are forced to repeat (because Recruit Count is higher than the available classes); this flag removes that restriction.  All selected classes are not guaranteed to be in the pool and a class may not necessarily be available at all in a given seed."
	},
	{
		"Id": "classAsNpcPromoCheckBox",
		"title": "Promoted Classes",
		"screenshot": "classAsNpcPromoCheckBox.png",
		"description": "All recruits will instead be from promoted classes. (Without this flag, they will always be unpromoted.)"
	},



	{
		"Id": "doubleBBCritCheckBox",
		"title": "Halve BB Crit Rate",
		"screenshot": "doubleBBCritCheckBox.png",
		"description": "Halves the Black Belt's unarmed critical hit rate, so that it is now equal to their current level. (Vanilla crit rate is equal to the character's level times 2.)"
	},
	{
		"Id": "thiefHitCheckBox",
		"title": "Thief Hit Rate Rebalance",
		"screenshot": "thiefHitCheckBox.gif",
		"description": "Increases the hit rate of Thieves and Ninjas from +2 per level to +4 per level, making them more effective combatants (helping to balance them in comparison to Fighters and Knights, which will still have significantly more HP and STR).\n[grid][r]{i}Hit% |Lvl 9|Lvl 17|Lvl 25[r]{l}Vanilla Thief|21%|37%|53%[r]{l}Fighter|34%|58%|82%[r]{l}Buffed Thief|37%|69%|101%"
	},
	{
		"Id": "thiefAgilityBuffDropDown",
		"title": "Thief Agility Buff",
		"screenshot": "thiefAgilityBuff.png",
		"description": "Improve the thief/ninja starting agility and starting evade, and make it so that they gain agility and evade on every level. This makes the Thief more likely to evade melee attacks from monsters.\nWhen the Thief is in the lead slot, this also increases the chance of getting first strike and reduces the chance of being surprised."
	},
	{
		"Id": "fixHitChanceCapCheckBox",
		"title": "Raise Hit % Cap",
		"screenshot": "fixHitChanceCapCheckBox.png",
		"description": "Changes the max hit percent (Hit %) from 200 to 250, allowing for an extra hit that can be gained when the stat is maxed."
	},
	{
		"Id": "MDefModeDropDown",
		"title": "MDef Growth Rebalancing",
		"screenshot": "MDefModeDropDown.gif",
		"description": "Changes how much MDef is gained per level up:\n[grid][r]{i}MDef Growth|Vanilla|BB/Master +3/+4|Inverted[r]{l}Black Belt|4|3|1[r]{l}Master|1|4|4[r]{l}Fighter & Knight|3|3|2[r]{l}Thief & Ninja|2|2|3[r]{l}Red Mage & Wizard|2|2|3[r]{l}White Mage & Wizard|2|2|3[r]{l}Black Mage & Wizard|2|2|3\n\nNotably, in Vanilla the Black Belt gets worse when promoted; using \"BB/Master +3/+4\" fixes this behavior."
	},

	{
		"Id": "RandomizeClassCheckBox",
		"title": "Blursed Classes",
		"screenshot": "RandomizeClassCheckBox.png",
		"description": "\"Blursed\" Classes (as in classes with \"blessings\" and \"curses\") give bonuses and maluses at random to each of the selectable classes in the game. These can change how desirable a given class will be and are not necessarily balanced with each other.\nPress Select at the Party Selection screen (and A at Status Screen) to reveal the modifiers applied to a given class.\nCheck \"Class Blursings\" on the Wiki (under Randomizer Documentation) for a breakdown of the possible blursings."
	},
	{
		"Id": "RandomizeClassCastingCheckBox",
		"title": "Add Spellcasting Bonuses",
		"screenshot": "RandomizeClassCasting.png",
		"description": "Add bonuses granting spellcasting abilities."
	},
	{
		"Id": "RandomizeClassChaosCheckBox",
		"title": "Chaos Mode",
		"screenshot": "RandomizeClassChaosCheckBox.png",
		"description": "Chaos Mode shuffles all the stats, spellcasting abilities, and equipment permissions between all the classes, making for classes with very different abilities from the vanilla game. Only for experienced players."
	},
	{
		"Id": "TransmooglifierCheckBox",
		"title": "Transmooglifier",
		"screenshot": "transmooglifier.gif",
		"description": "Procedurally generates six custom classes from a set of 26. Each class corresponds to heuristically randomized spell permissions, stats, equipment sets, abilities, and blursings - this means the classes will have unique properties every time. They can be described as \"What you might expect from a class named X\".\nThis also disables most specific balance options. Character specific buffs will refer to character slot. Example: Fighter XP will now refer to 'Slot 0 character class XP Bonus'."
	},
	{
		"Id": "GuaranteeCustomClassCompositionCheckBox",
		"title": "Guarantee Custom Class Composition",
		"screenshot": null,
		"description": "Guarantees you will be offered a balanced party of classes, including: a heavy armor class, an agility or luck class, an unarmed or low armor class, a white magic recovery class, an offensive mage class, and a hybrid class."
	},
	{
		"Id": "MooglieWeaponBalanceCheckBox",
		"title": "Balance Weapons for Customs",
		"screenshot": null,
		"description": "Recategorizes weapons to improve end game weapons that are not Masamune or Katana. Specifically: \n• Dragon Sword: now Dragon Chucks - 29 Dmg, 0 Hit, 30 Crit.\n• Cat Claw: 30 Crit.\n• Light Axe: 50 dmg\n• Thor Hammer: 40 Crit, LIT, DRAGON, GIANT damage\n• Bane: 30 dmg, MAGE, DRAGON, REGEN damage, now a Shortsword\n• Defense: +10 dmg\n• Katana: Now a Scimitar not a Knife\n• Ice Sword: Now a Scimitar not a Longsword.\n\nDoes not work with Weaponizer"
	},
	{
		"Id": "RandomizeClassInnateMagicCheckBox",
		"title": "Blursed Classes - Innate Magic",
		"screenshot": "RandomizeClassInnateMagicCheckBox.png",
		"description": "Adds a set of bonuses that give a set of starting spells at the level 8 slots, regardless of their actual spell level. Also gives 2 MPs of that level to be able to cast them.\n[grid][r]Tele Magic|WARP & EXIT[r]{l}Buff Magic|TMPR, FAST, & INV2[r]{l}Self Magic|RUSE & SABR[r]{l}Heal Magic|CUR3, HEL2, & LIFE[r]{l}Heal+ Magic|CUR4, HEL3, & LIFE[r]{l}Elem Magic|ICE2, FIR2, & LIT2[r]{l}Elem+ Magic|ICE3, FIR3, & LIT3[r]{l}Nuke Magic|NUKE[r]{l}Doom Magic|3 random spells causing instant death/stone[r]{l}Clean Magic|3 random status cures (incl. LIFE/LIF2)\n\nDoom and Nuke Magic are for spellcasters only; Self Magic is melee only. Nuke Magic is rare; Elem+, Heal+, and Buff Magic are rare for melee classes."
	},
	{
		"Id": "RandomizeClassIncludeXpBonuxCheckBox",
		"title": "Blursed Classes - XP Bonus",
		"screenshot": "randomizeClassIncludeXpBonuxCheckBox.png",
		"description": "Adds a set of bonuses that can give classes more xp gain than others. This bonus is multiplicative with the flagset's exp multiplier."
	},
	{
		"Id": "ClassXpBonus",
		"title": "Class XP Bonus",
		"screenshot": "classXPBonus.png",
		"description": "Gives the selected class a multiplier to exp. This bonus is multiplicative with the flagset's exp multiplier. For example, flagset XP scaling of 2.0x and a class bonus of 1.5x will have a total of 3.0x for that class.\nNote: With extremely low XP scaling and class bonus, it is possible to reach the maximum of 999,999 XP and no longer be able to level up. (At the most extreme, 1.0x scaling and a 0.5x class bonus effectively caps the class at Level 35.)"
	},
	{
		"Id": "RandomizeClassKeyItemsCheckBox",
		"title": "Blursed Classes - Start with Key Items",
		"screenshot": "RandomizeClassKeyItemsCheckBox.png",
		"description": "Each class will start with a different Key Item, separate from the normal count for Bonuses (so they will still each get Key Items when Bonuses is set to 0). This is separate from Incentives, and will only include standard Key Items (such as OXYALE or TNT), not any other incentivized equipment. Characters gained mid-game via recruitment (Party tab) will still come with their appropriate Key Item.\nFree or Removed Key Items aren't included. If Thief Lockpicking is enabled, KEY will be excluded. These Key Items are never included: BRIDGE, SHIP, CANAL, CANOE, FLOATER.\nIn NoOverworld gamemode, the SIGIL and the MARK are included."
	},
	{
		"Id": "EnableRandomPromotions",
		"title": "Random Promotions",
		"screenshot": "EnableRandomPromotions.gif",
		"description": "When giving the TAIL to Bahamut, the wise dragon will promote your party to various, random classes. Random classes are pre-selected by the randomizer when the seed is generated. You will not know ahead of time what that promoted class will be."
	},
	{
		"Id": "RPIncludeBaseClasses",
		"title": "Include Base Classes",
		"screenshot": "RPIncludeBaseClasses.gif",
		"description": "Base classes can now be in the possible promotion pool when returning the TAIL to Bahamut."
	},
	{
		"Id": "RPSpoilers",
		"title": "Spoil Promotions",
		"screenshot": "RPSpoilers.png",
		"description": "The names of the various classes with be changed to show what classes they will become after promotions.\nFormat: Current Class - Promotion Class"
	},
	{
		"Id": "MpGainOnMaxGainModeDropDown",
		"title": "Gain Spell Charges With Max MP Gain",
		"screenshot": null,
		"description": "When a character gains Max MP, they also gain a current MP in that spell slot. \n\nThis can be enabled for all classes, only for classes once they promote, or only for classes that receive the 'Max+MP+' class blessing (which will only show up when this option is set to blessed classes)."
	},
	{
		"Id": "EarlierHighTierMagic",
		"title": "Earlier High-Tier Magic Charges",
		"screenshot": "EarlierHighTierMagic.png",
		"description": "Charges for Tier 5-8 spells are progressively gained at earlier levels for all Mages; Tier 7-8 charges are still somewhat limited.\n\nProgression still follows a logical pattern similar to vanilla and no spell charges are gained later than vanilla. A few lower-tier charges are also gained earlier to ensure you always gain at least one charge on every level up. White/Black Mages now get full charges at Level 45 and Red Mages now get full charges at Level 50.\n[grid][r]{i}Vanilla ➔ Modified|Tier-5|Tier-6|Tier-7|Tier-8[r]{l}WM & BM 1st Charge|12 ➔ 11|16 ➔ 14|20 ➔ 17|25 ➔ 20[r]{l}WM & BM 4th Charge|18 ➔ 17|22 ➔ 20|26 ➔ 25|30 ➔ 27[r]{l}Red M. 1st Charge|15 ➔ 13|20 ➔ 15|26 ➔ 19|31 ➔ 23[r]{l}Red M. 4th Charge|21 ➔ 20|26 ➔ 24|32 ➔ 28|36 ➔ 31\n"
	},
	{
		"Id": "ChangeMaxMP",
		"title": "Change Spellcaster Max MP",
		"screenshot": "ChangeMaxMP.png",
		"description": "Allows control over the maximum spell charges per spell level for each spellcasting class in the game. This does not change when they receive new spell levels (as that's tied to experience level). A value of less than 2 will not reduce the starting Level 1 charges of Red, white, and Black mages."
	},
	{
		"Id": "AllSpellLevelsForKnightNinja",
		"title": "Knight and Ninja Gain Charges in All Levels",
		"screenshot": "AllSpellLevelsForKnightNinja.png",
		"description": "Sets the Knight and Ninja magic charge growth to give a charge in all levels whenever those classes gain a charge in any level, giving Knight and Ninja tier 4-8 charges. This alleviates an issue with \"Keep Permissions\" where the Knight and Ninja could never cast spells they could learn, but is useless otherwise."
	},
	{
		"Id": "startingEquipmentHealStaff",
		"title": "Starting Equipment - Heal Staff",
		"screenshot": "startingEquipmentHealStaff.png",
		"description": "Places a Heal Staff (or any low level Heal casting weapon, or a Heal Helment if nothing else is found in the game) into the party's starting inventory."
	},
	{
		"Id": "startingEquipmentDragonslayer",
		"title": "Starting Equipment - Dragonslayer",
		"screenshot": "startingEquipmentDragonslayer.png",
		"description": "Places the Dragon Armor and the Dragon Sword into the party's starting inventory.\nIncompatible with Weaponizer."
	},
	{
		"Id": "startingEquipmentLegendKit",
		"title": "Starting Equipment - Legendary Kit",
		"screenshot": "startingEquipmentLegendKit.png",
		"description": "Places the Xcalber, Opal Armor, Opal Gauntlets, Opal Helm, and Opal Shield into the party's starting inventory.\nIncompatible with Weaponizer."
	},
	{
		"Id": "startingEquipmentGrandpasSecretStash",
		"title": "Starting Equipment - Grandpa's Secret Stash",
		"screenshot": "startingEquipmentGrandpasSecretStash.png",
		"description": "Adds three items that are either legendary tier (e.g. Dragon Armor, Vorpal) or caster items (e.g. Heal Helmet) as well as five common tier items to the party's starting inventory."
	},
	{
		"Id": "startingEquipmentRandomCommons",
		"title": "Starting Equipment - Random Commons",
		"screenshot": "startingEquipmentRandomCommons.png",
		"description": "Fills up the party's entire inventory with random equipment. There is a small chance to roll rare and legendary items into this mix of gear."
	},
	{
		"Id": "startingEquipmentOneItem",
		"title": "Starting Equipment - One Powerful Item",
		"screenshot": null,
		"description": "Adds one item that is either legendary tier (e.g. Ribbon, Katana) or a caster item (such as the Bane Sword) to the party's starting inventory."
	},
	{
		"Id": "startingEquipmentRandomTypeWeapon",
		"title": "Starting Equipment - Random Type Weapon",
		"screenshot": "startingEquipmentRandomTypeWeapon.png",
		"description": "Adds a random weapon that will have a bonus vs. some weakness (e.g. Rune Sword, Flame Sword, Light Axe, etc) into the party's starting inventory. The Xcal is not in this pool of potential gear."
	},
	{
		"Id": "startingEquipmentStarterPack",
		"title": "Starting Equipment - Random Starter Pack",
		"screenshot": "startingEquipmentStarterPack.png",
		"description": "Adds four random shop-purchasable body armors and four random common tier weapons into the party's starting inventory.\n\nOne Armor will be added from a pool of armor that a fighter can wear, one armor from the red mage pool, then the last two (2) armors will be equippable by mages. Armor selection is weighted and will tend more towards cheaper armors."
	},

	{
		"Id": "startingEquipmentNoDuplicates",
		"title": "Starting Equipment - No Legendary Duplicates",
		"screenshot": "startingEquipmentNoDuplicates.png",
		"description": "Prevents receiving more than one of the same Rare/Legendary item in your starting equipment when selecting options that have potential for duplicates."
	},
	{
		"Id": "startingEquipmentRemoveFromPool",
		"title": "Starting Equipment - Remove Items from Treasure Chests",
		"screenshot": "startingEquipmentRemoveFromPool.png",
		"description": "For every rare or legendary starting equipment received an identical item potentially found in a chest will be replaced with something worse.\nExample: Starting the game with a Zeus Gauntlet means a Zeus Gauntlet chest in the world is altered to contain a Silver Gauntlet."
	},

	{
		"Id": "RandomWeaponBonus",
		"title": "Random Weapon Bonus",
		"screenshot": "RandomWeaponBonus.png",
		"description": "Gives each weapon a random numerical modification from a selected range. This will increase or decrease (if negative) its:\n- Damage by 2 per point\n- Hit by 3 (max 50%) per point\n- Crit by 3 (1.5%) per point\nValues cannot go below zero (0) Hit or one (1) Crit/Damage."
	},
	{
		"Id": "RandomWeaponBonusExcludeMasa",
		"title": "Random Weapon Bonus - Exclude Masa",
		"screenshot": "RandomWeaponBonusExcludeMasa.png",
		"description": "Masamune will not receive any bonuses or minuses; it will always be the regular, vanilla Masamune."
	},
	{
		"Id": "RandomArmorBonus",
		"title": "Random Armor Bonus",
		"screenshot": "RandomArmorBonus.png",
		"description": "Gives each armor a random numerical modification from a selected range. This will increase or decrease (if negative) its Absorb by 1 per point (2 points for body armor) and reduce (or increase if the modification is a negative number) its Weight penalty by 1 per point (2 points for body armor)."
	},

	{
		"Id": "doubleWeaponCritCheckBox",
		"title": "Double Weapon Crit Rate",
		"screenshot": "doubleWeaponCritCheckBox.png",
		"description": "Doubles the crit rate of all weapons, making them more effective and balancing weapon wielders in comparison to Black Belts and their unarmed attacks."
	},
	{
		"Id": "increaseWepBonusesCheckBox",
		"title": "Weapon Attack Bonuses",
		"screenshot": "increaseWepBonusesCheckBox.png",
		"description": "Increases elemental and \"type\" bonuses to weapons, improving the damage bonus from +4 (vanilla behavior) to +X (based on the slider)."
	},

	{
		"Id": "startingItemsDropDown",
		"title": "Starting Inventory",
		"screenshot": "startinginventory.png",
		"description": "Starts the game with a set of consumable items.\n[grid][r]{i}Option|{i}Tent|{i}Cabin|{i}House|{i}Heal|{i}Pure|{i}Soft[r]{l}SafetyBit|1||||1|1[r]{l}Beggar's Choice|5|||20|2|1[r]{l}Just Tents|10|||||[r]{l}Explorer Pack|10|||50|4|2[r]{l}Real Estate|15|3|1|||[r]{l}Warrior's Standard|15|3|1|50|6|3[r]{l}Royal Packmule|50|15|5|99|10|5[r]{l}Duckling Boon|99|99|99|99|99|99[r]{l}R. Beggar's Choice|1-5|||0-20|0-2|0-1[r]{l}R. Explorer Pack|1-10|||0-50|0-4|0-2[r]{l}R. Warrior's Standard|3-15|0-3|0-1|20-50|2-6|1-3[r]{l}R. Royal Packmule|10-50|5-15|1-5|30-99|5-10|2-5[r]{l}R. High Rolling|35-99|10-25|5-10|30-99|10-20|5-10[r]{l}Randomized|0-99|0-99|0-99|0-99|0-20|0-10\n"
	},
	{
		"Id": "consumableTreasureStackSizeDropDown",
		"title": "Consumable Treasure Stack Size",
		"screenshot": "consumableTreasureStackSizeDropDown.png",
		"description": "Consumable rewards from chests and NPCs may give you more than one item.\n[grid][r]{i}Option|{i}Tent|{i}Cabin|{i}House|{i}Heal|{i}Pure|{i}Soft[r]{l}Stingy|2|||5||[r]{l}Adequate|3|2||10|2|2[r]{l}Generous|5|3|2|20|3|2[r]{l}Ridiculous|10|5|3|50|5|5\n\nNote: In-game text only shows a single consumable no matter how many you gained."
	},
	{
		"Id": "consumableChestSetDropDown",
		"title": "Consumable Chests",
		"screenshot": "consumableChestSetDropDown.png",
		"description": "Changes the amount of chests that contain consumable items, removing gold rewards and gear.\n[grid][r]{i}Option|{i}Tent|{i}Cabin|{i}House|{i}Heal|{i}Pure|{i}Soft[r]{l}Vanilla|2|7|7|10|5|5[r]{l}Low|4|3|3|10|10|10[r]{l}Medium|7|4|4|15|15|15[r]{l}High|8|6|6|20|20|20[r]{l}Extreme|10|10|10|30|30|30[r]{l}The ..... Party Pack|||||99|99[r]{l}Random Low|0-10|0-10|0-10|0-30|0-30|0-30[r]{l}Random|0-33|0-33|0-33|0-99|0-99|0-99\n"
	},
	{
		"Id": "housesFillHpCheckBox",
		"title": "House Full HP Restoration",
		"screenshot": "housesFillHpCheckBox.gif",
		"description": "Houses completely restore the party's HP. Unchecked, using a HOUSE restores 120HP to each Light Warrior (the vanilla behavior)."
	},
	{
		"Id": "improvedClinicCheckBox",
		"title": "Clinics are Free & Heal All Statuses",
		"screenshot": "improved-clinic.png",
		"description": "In addition to reviving dead characters at 1 HP, all clinics now heal Poison and Stone statuses (without affecting your HP).\nClincs are also now free."
	},
	{
		"Id": "etherizerCheckBox",
		"title": "Turn Shelters into Ethers",
		"screenshot": "etherizerCheckBox.png",
		"description": "Tents, Cabins, and Houses become ethers. Instead of restoring HP and saving on the overworld, they restore MP and can be used anywhere.\nEthers (ETHR) restore a charge for L1-L2. Dry Ethers (DRY) restore a charge for L1-L4. X Ethers (XETH) restore a charge for L1-L8.\nIncompatible with the \"House MP Restoration\" bug fix flag."
	},

	{
		"Id": "enableExtConsumables",
		"title": "New Consumables",
		"screenshot": "newConsumables.png",
		"description": "Enables new consumables:\n[grid][r]{i}Item|{i}Effect[r]FCURE|Full cure[r]PHNIX|Raise dead light warrior[r]SMOKE|Automatic run from battle[r]BLAST|Cast FIR3[r]RFRSH|Cast HEL3[r]FLARE|Cast NUCLEAR[r]BLACK|Cast BANE with lower accuracy[r]GUARD|Cast FOG2[r]QUICK|Cast FAST[r]HIGH|Restores 160 HP[r]WIZRD|Cast CONF[r]CLOAK|Cast RUSE\n\nPHNIX can be used during battle if the \"Enable Life in Battle\" flag is set.\nSMOKE will allow you to run from any fight, including bosses. However, you will be placed back one step and will still have to fight them.\nBLACK has 24 accuracy, the same as RUB. (BANE has 40 accuracy and ZAP! has 32, for comparison.) You can also use BLACK outside of battle if you wish to kill one of your light warriors.\nHIGH Potions will randomly restore between 96 and 192 HP when used during battle."
	},
	{
		"Id": "extStartingItemSet",
		"title": "New Consumables Starting Inventory",
		"screenshot": "extStartingItemSet.png",
		"description": "Starts the game with a set of the new consumable items in the party's item bag.\n[grid][r]{i}Option|{i}FCure|{i}Phnix|{i}Blast|{i}Smoke[r]{l}None||||[r]{l}Lifeline|1|1||[r]{l}Just Smokes||||10[r]{l}Bangs and Smokes|||5|5[r]{l}Jester's Secret|2|1|5|5[r]{l}Adventurer's Fortune|3|2|10|10[r]{l}Blackbelt's Favorite|5|3|20|20[r]{l}Illegal Advantage|99|99|99|99[r]{l}R. Jester's Secret|0-2|0-1|0-5|0-5[r]{l}R. Adventurer's Fortune|0-3|0-2|0-10|0-10[r]{l}R. Blackbelt's Favorite|0-5|1-3|0-20|0-20[r]{l}R. High Rolling|2-5|2-5|5-30|5-30[r]{l}Randomized|0-15|0-10|0-50|0-50\n"
	},
	{
		"Id": "extConsumableChests",
		"title": "New Consumable Chests",
		"screenshot": "extConsumableChests.png",
		"description": "Changes the amount of chests that contain the new consumable items, removing gold rewards and gear.\n[grid][r]{i}Option|{i}FCure|{i}Phnix|{i}Blast|{i}Smoke[r]{l}None||||[r]{l}Low|1|1|1|1[r]{l}Medium|3|3|3|3[r]{l}High|5|5|5|5[r]{l}Extreme|10|10|10|10[r]{l}Random Low|0-5|0-5|0-5|0-5[r]{l}Random|0-15|0-15|0-15|0-15\n"
	},
	{
		"Id": "extConsumableTreasureStackSize",
		"title": "New Consumable Treasure Stack Size",
		"screenshot": "extConsumableTreasureStackSize.png",
		"description": "New Consumable rewards from chests and NPCs may 'stack', giving you more than one item.\n[grid][r]{i}Option|{i}FCure|{i}Phnix|{i}Blast|{i}Smoke[r]{l}Stingy|||2|2[r]{l}Adequate|2||3|3[r]{l}Generous|3|2|5|5[r]{l}Ridiculous|5|3|10|10\nNote: In-game text only shows a single consumable no matter how many you gained."
	},
	{
		"Id": "normalShopsHaveExtConsumables",
		"title": "New Consumables in Shops",
		"screenshot": "newConsumables.png",
		"description": "The new Consumables appear in item shops. Replaces two (2) HEAL pot location, a PURE pot location, and a SOFT pot location with the new consumables."
	},
	{
		"Id": "legendaryShopHasExtConsumables",
		"title": "New Consumables in Legendary Shop",
		"screenshot": "newConsumables.png",
		"description": "The new Consumables can appear in legendary item shop. The legendary item shop will have 1-2 random new consumables.\nRequires the Legendary Item Shop flag to be set, in the Shops & Magic Tab."
	},

	{
		"Id": "guaranteedDefenseItem",
		"title": "Guaranteed Defense Item",
		"screenshot": "ruseItemCheckBox.png",
		"description": "Guarantees that the Power Staff has RUSE/INV/INV2 depending on the setting. (This item can be incentivized on the Incentives tab.)\n\"Any\" selects from any of the possible spell options; \"Random\" can also select \"None\"."
	},
	{
		"Id": "guaranteedPowerItem",
		"title": "Guaranteed Offense Item",
		"screenshot": null,
		"description": "Guarantees that the Power Gauntlet has SABR/TMPR/FAST depending on the setting. (This item can be incentivized on the Incentives tab.)\n\"None\" will still cast SABR but be named \"Power\" when Vanilla Item Magic is selected. If Item Magic is Randomized, then None will assign the Power Gauntlet a random spell from the selected Item Magic Pool.\n\"Any\" selects from any of the possible spell options; \"Random\" can also select \"None\"."
	},
	{
		"Id": "itemMagicCheckBox",
		"title": "Item Magic Shuffle",
		"screenshot": "itemMagicCheckBox.png",
		"description": "This flag shuffles what spell is cast when using any of the castable items (Power Gauntlet, Bane Sword, etc.).\n The spell name will replace the name of the item for clarity, although icons will remain the same (or absent in the case of the Defense sword). Items that use the same icon cannot be differentiated except by equipping (i.e., White Shirt and Black Shirt).\nNote: Spell effects do not change the innate magic defense bonuses of the items (i.e., Black Shirt will still provide protection from ICE and TIME elements, even if it becomes the AMUT Shirt)."
	},
	{
		"Id": "balancedItemMagicCheckBox",
		"title": "Balanced Shuffle",
		"screenshot": "balancedItemMagicCheckBox.png",
		"description": "Remove all of the most powerful spells from the potential spell pool of Item Magic.\n For example, this removes the potential for a NUKE Axe.\n To accommodate Spellcrafter mode, the heuristics that determine what is not allowed are very complex. Basically, almost nothing better than the vanilla buff and debuff magic is possible, nor are damage spells better than the vanilla level 3 versions for each element. The purpose of this flag is therefore to avoid otherwise challenging seeds that are trivialized by the presence of overpowered caster items."
	},
	{
		"Id": "magisizeWeaponsCheckBox",
		"title": "All Weapons Cast Spells",
		"screenshot": "magisizeWeapons.png",
		"description": "ALL weapons can cast spells based on the Item Magic Pool, instead of only equipment that normally casts spells."
	},

	{
		"Id": "weaponizerCheckBox",
		"title": "Use Weaponizer",
		"screenshot": "weaponizer.png",
		"description": "Generates random weapons. Names are assigned based on casting, bonuses vs monster types/weaknesses, or quality. Press 'select' on the equip or shop screen to view exact stats. There is a 50% chance of a rare weapon being promotion locked. Legendary weapons (Katana, XCalibr, Masamune) have vanilla class restrictions.\n[grid][r]|Class permissions[r]Fighter|Swords, Axes, Knives, Hammers[r]Thief|Swords, Knives, Nunchucks[r]Black Belt|Nunchucks[r]Red Mage|Swords, Knives, Staves[r]White Mage|Hammers, Staves[r]Black Mage|Knives, Staves\n\n[grid][r]{b}Name|{b}Element/Type| ┇ |{b}Tier|{b}Name[r]Chroma, Prism|All types & elements| ┇ |1|Wooden, Small, Short[r]Boss|Aqua, Mage, Regen [Slays Fiends & WarMech]| ┇ |2|Copper, Long[r]Elmntl|Fire, Ice, Lit, Poison| ┇ |3|Iron, Heavy[r]IceHot|Fire, Ice| ┇ |4|Steel, Great[r]Odd, Weird|Regen, Were, Earth, Death, Time, Status| ┇ |5|Silver, Shiny[r]Shock, Bolt, Storm|Lightning (Storm also slays Aquatic)| ┇ |6|Mithrl, Sharp[r]Flame, Blaze, etc.|Fire, Undead, Were| ┇ |7|Opal, Diamnd, Wicked[r]Poison|Poison\n\nIcy/Frozen/Cold/etc., Giant/Imp/Ogre, Dragon/Dino, Rune/Ritual, Sun/Holy/Banish/etc., and Coral/Aqua/etc. all slay the same types as they do in vanilla. Check the Wiki for information on enemy weaknesses & types.\nIf you're also using Blursed Weapons, the names may be easier to understand if you turn on \"Cleaner Blursed Names\" under the Quality of Life tab."
	},
	{
		"Id": "weaponizerPowersCheckBox",
		"title": "Common Weapons Can Have Powers",
		"screenshot": "weaponizerCommonPower.png",
		"description": "Common (shop) weapons can have spells or bonuses vs monster types or elemental weaknesses."
	},
	{
		"Id": "weaponizerNamingCheckBox",
		"title": "Weaponizer Names Use Quality Only",
		"screenshot": "weaponizerNaming.png",
		"description": "Weaponizer does not name weapons for their bonuses vs monster types or elemental weaknesses, only quality or spell casting."
	},



	{
		"Id": "houseMPRestorationCheckBox",
		"title": "House MP Restoration",
		"screenshot": "houseMPRestorationCheckBox.png",
		"description": "Fixes a bug where the party's MP was restored only after the game was saved."
	},
	{
		"Id": "weaponStatsCheckBox",
		"title": "Weapon Stats",
		"screenshot": "weaponStatsCheckBox.png",
		"description": "Fixes applying elemental and \"type\" bonuses to weapons. These bonuses did not work as intended in the vanilla game, but function properly here for all relevant gear."
	},
	{
		"Id": "chanceToRunDropDown",
		"title": "Chance to Run",
		"screenshot": "chanceToRunDropDown.png",
		"description": "Changes the way the chance to run is calculated.\nBugged: Run chance is calculated from a glitched stat as it was programmed in the original NES release.\nCorrected: Run chance is calculated from the intended stat, Luck. This greatly improves the effectiveness of the RUN command, as well as classes with high Luck stats, such as the Thief.\n Percentages: Run chance is the selected static value for all classes. This causes no specific class to be any better or worse at running away because their chance to run is the same."
	},
	{
		"Id": "spellBugsCheckBox",
		"title": "Spell Fixes",
		"screenshot": "spellBugsCheckBox.png",
		"description": "Fixes multiple bugs in various spells, such as TMPR, SABR, XFER, and HEL2, so that they provide their proper effect (as opposed to not working, or even in some cases providing an opposite effect from what was intended, as in the vanilla game). Also fixes enemy AoE spell targeting and provides the opportunity to cancel out of casting WARP or EXIT."
	},
	{
		"Id": "enemyStatusAttackBugCheckBox",
		"title": "Enemy Status Attacks",
		"screenshot": "enemyStatusAttackBugCheckBox.png",
		"description": "Fixes a bug where enemies had a chance to apply a status ailment on attacks that missed once the first attack connected. When enabled, only enemy hits that connect have a chance to inflict status effects (so no more getting killed by 12 hits of Death Touch when all of them miss, unlike in the vanilla game)."
	},
	{
		"Id": "blackBeltAbsorbCheckBox",
		"title": "Bl. Belt & Master Absorb Calculation",
		"screenshot": "blackBeltAbsorbCheckBox.gif",
		"description": "Fixes a bug in the way the Black Belts' & Masters' Absorb stat is calculated. Unchecked, Absorb is set to the Light Warrior's level so long as the character does not have a weapon equiped (instead of using their armor). Enabled, the absorb is applied only when the Light Warrior does not have any armor equipped, the intended behavior."
	},
	{
		"Id": "improveTurnOrderRandomizationCheckBox",
		"title": "Improve Turn Order Randomization",
		"screenshot": "improveTurnOrderRandomizationCheckBox.png",
		"description": "Improves the balance of turn randomization. Unchecked, the turn order is weighted in favor of the enemies. Enabled, turn order is more balanced."
	},

	{
		"Id": "rngCheckBox",
		"title": "RNG Tables",
		"screenshot": "rngCheckBox.gif",
		"description": "Shuffles the RNG Table and the Battle RNG, changing encounters and the distance between encounters while leaving overall probabilites unchanged."
	},
	{
		"Id": "fixMissingBattleRngEntry",
		"title": "Fix Missing Battle RNG Entry",
		"screenshot": "fixMissingBattleRngEntry.gif",
		"description": "The vanilla Battle RNG table has two 0x00s out of 256 hex values. If checked, this flag replaces one of them with 0x95, the missing hex value. In essence, this takes some spells and effects and reduces the likelihood of them occuring (so the famous 3 in 256 chance to critical hit with spells becomes a 2 in 256 chance)."
	},

	{
		"Id": "disableTentSaving",
		"title": "Disable Tent/Cabin/House Saving on Overworld",
		"screenshot": "disableTentSaving.gif",
		"description": "When enabled, using a TENT, CABIN, or HOUSE will only restore HP/MP and not save the game."
	},
	{
		"Id": "disableInnSaving",
		"title": "Disable Inn Saving",
		"screenshot": "disableInnSaving.png",
		"description": "When enabled, staying at an inn will only restore HP/MP, but not save the game."
	},
	{
		"Id": "saveGameWhenGameOverCheckBox",
		"title": "Save Game When Game Over",
		"screenshot": "saveGameWhenGameOverCheckBox.png",
		"description": "When enabled, if your party perishes, you will respawn with all of your progression (items acquired, levels gained, etc.) intact. If you have the SHIP (but not the airship), you will respawn where you last docked; if you have the AIRSHIP, you will respawn at the airship and the ship will be waiting for you at Coneria; if you have neither, you will respawn where you last saved."
	},
	{
		"Id": "saveGameDWModeCheckBox",
		"title": "Dragon Warrior Mode",
		"screenshot": "saveGameDWModeCheckBox.png",
		"description": "Always respawn at Coneria (the Ship and Airship will wait for you there if you have them). Gold is halved."
	},

	{
		"Id": "noPartyShuffleCheckBox",
		"title": "No Party Shuffle",
		"screenshot": "noPartyShuffleCheckBox.png",
		"description": "If enabled, the player's party is not automatically rearranged when afflicted with status ailments or slain."
	},
	{
		"Id": "speedHacksCheckBox",
		"title": "Speed Hacks",
		"screenshot": "speedHacksCheckBox.gif",
		"description": "If enabled, many game processes such as area transitions, opening the menu, loading the mini-map, and battle animations are significantly faster."
	},
	{
		"Id": "speedboatCheckBox",
		"title": "Faster Ship",
		"screenshot": "speedboatCheckBox.gif",
		"description": "Double the speed of the Ship, so it is the same speed as the Airship."
	},
	{
		"Id": "identifyTreasuresCheckBox",
		"title": "Identify Treasures",
		"screenshot": "identifyTreasuresCheckBox.png",
		"description": "If enabled, the player can see what item is in a chest if their inventory is full, instead of seeing \"Can't hold any more\"."
	},
	{
		"Id": "dashCheckBox",
		"title": "Faster Walking Speed",
		"screenshot": "dashCheckBox.gif",
		"description": "If enabled, the player's movement speed on foot is doubled. Hold B while walking to reduce to normal speed."
	},
	{
		"Id": "buyTenCheckBox",
		"title": "Buy Quantity",
		"screenshot": "buyTenCheckBox.png",
		"description": "If enabled, the player has the option to select the quantity of items bought in the item shop.\nPress left to reduce quantity by 1, right to increase quantity by 1, up to increase quantity by 10, and down to decrease quantity by 10."
	},
	{
		"Id": "waitWhenUnrunnableCheckBox",
		"title": "WAIT When Unrunnable",
		"screenshot": "waitWhenUnrunnableCheckBox.png",
		"description": "If enabled, the player is notified when it is impossible to escape a battle by replacing the RUN command with WAIT."
	},
	{
		"Id": "enableCritNumberDisplayCheckBox",
		"title": "Critical Hit Count Display",
		"screenshot": "enableCritNumberDisplayCheckBox.png",
		"description": "If enabled, critical hits note how many hits out of the maximum connected with a critical.\nFor example: 2 critical hits out of 3, instead of simply marking that there was a critical."
	},
	{
		"Id": "battleMagicMenuWrapAroundCheckBox",
		"title": "Battle Magic Menu Wrap Around",
		"screenshot": "battleMagicMenuWrapAroundCheckBox.gif",
		"description": "If enabled, allows the player to \"wrap\" up and down in the battle magic menu, making navigating to the upper level magic much faster in combat."
	},
	{
		"Id": "npcSwatterCheckBox",
		"title": "NPC Guillotine",
		"screenshot": "npcSwatterCheckBox.gif",
		"description": "Talking to certain NPCs removes them from the map when their dialog is dismissed. This can be used to make bats go away, for example.\nOnly works on NPCs that have a single line of dialogue in the game. For instance, the townspeople of Pravoka will say different things before and after you fight Bikke and his pirate squad, so these NPCs cannot be \"swatted\"."
	},
	{
		"Id": "inventoryAutosortCheckBox",
		"title": "Autosort Inventory",
		"screenshot": "inventoryAutosortCheckBox.png",
		"description": "If enabled, HEAL, PURE, and SOFT potions are automatically moved to the first row of the item menu, followed by saving items (TENTs, CABINs, and HOUSEs) on the second row, then all other key items in your inventory.\nNote: if \"New Consumables\" is on, these consumable items will be placed in the third row, with Key Items flowing after."
	},
	{
		"Id": "shopInfoCheckBox",
		"title": "Shop Information",
		"screenshot": "ShopInfoFlag.png",
		"description": "In shops, characters will strike their victory pose if they can equip a piece of equipment or learn a spell.\nPress Select to show a description of an item or a spell."
	},
	{
		"Id": "chestInfoCheckBox",
		"title": "Chest Information",
		"screenshot": "chestInfoCheckBox.png",
		"description": "Shows a description of weapons and armors when opening chests."
	},
	{
		"Id": "incentiveChestItemsFanfareCheckBox",
		"title": "Gear Incentive Chest Items Fanfare",
		"screenshot": "incentiveChestItemsFanfareCheckBox.png",
		"description": "Gear in treasure chests that is marked as incentivized will play the fanfare that is usually played when you obtain a Key Item. In the event a ribbon or katana is incentivized, the fanfare will only play for the one item that was incentivized."
	},



	{
		"Id": "sanityCheckerV2",
		"title": "Sanity Checker V2",
		"description": "Alternative item placement engine that allows the randomizer to accept more complex map changes."
	},
	{
		"Id": "gameMode",
		"title": "Game Mode",
		"screenshot": "deepdungeon.png",
		"description": "Select the type of gameplay.\n\nStandard: Normal game mode where you explore the world, dive dungeons and prepare for your fight againt Chaos.\nDeep Dungeon: Turns Coneria Castle into a 52-floor completely procedurally generated dungeon. As you go deeper, the monster encounters get stronger and every so often there will be a branch to the next town, but dying or restoring a save will return you to the overworld. Somewhere within the dungeon is a TAIL and Bahamut.\nNo Overworld: Removes the overworld from the game entirely; towns and dungeons are connected directly by stairs and warps. The FLOATER and the CANOE are replaced respectively by the SIGIL and Lukahn's MARK."
	},
	{
		"Id": "owMapExchange",
		"title": "Overworld Map",
		"screenshot": "owMapExchange.png",
		"description": "Select the layout of Overworld.\nVanilla: The original Final Fantasy 1 Overworld.\nGenerate New Overworld: Creates a completely new overworld, vanilla access requirements (game is beatable even vanilla progression/no treasure shuffle). Map generation is resource-intensive and may take 30-60 seconds during which time your browser may be unresponsive. If a seed fails to generate a map, try a different seed, or select Use Pregenerated Map.\nLost Woods: Randomly generated endless forest map.\nDesert of Death: Randomly generated deadly desert map.\nImport custom map: Import a map using the 'Import map' button."
	},
	{
		"Id": "usePregenCheckBox",
		"title": "Use Pregenerated Map",
		"screenshot": "pregen256.png",
		"description": "Use one of the 256 pregenerated maps for a quicker and error free access to the generated new overworld experience."
	},
	{
		"Id": "shuffledAccessCheckBox",
		"title": "Shuffled Access",
		"screenshot": "procgenowShuffledAccess.png",
		"description": "Locations are placed with random item requirements (e.g. could need canoe to reach Elfland, or airship to reach Matoya)."
	},
	{
		"Id": "unsafeStartCheckBox",
		"title": "Unsafe Start",
		"screenshot": "procgenowUnsafeStart.png",
		"description": "May place late-game dungeons in starting area."
	},
	{
		"Id": "enableArchipelago",
		"title": "Enable Archipelago Support",
		"screenshot": "archipelagoEnable.png",
		"description": "Create a game that's compatible with Archipelago Multi-Worlds, allowing different games to share the same treasure pool. By default, only Key Items are included in the common treasure pool. Requires Archipelago's client."
	},
	{
		"Id": "enableArchipelagoShards",
		"title": "Add Shards",
		"screenshot": "archipelagoShards.png",
		"description": "Add Shards to the common treasure pool."
	},
	{
		"Id": "enableArchipelagoGold",
		"title": "Add Gold",
		"screenshot": "archipelagoGP.png",
		"description": "Add GP treasures to the common treasure pool."
	},
	{
		"Id": "enableArchipelagoConsumables",
		"title": "Add Consumables",
		"screenshot": "archipelagoConsumables.png",
		"description": "Add consumables to the common treasure pool."
	},
	{
		"Id": "enableArchipelagoEquipment",
		"title": "Add Equipment",
		"screenshot": "archipelagoEquipment.png",
		"description": "Add equipment to the common treasure pool."
	},
	{
		"Id": "procGenEarth1",
		"title": "Generated Earth Cave B1",
		"screenshot": "procGenEarth1.png",
		"description": "Randomly generates the map for the first level of Earth Cave, creating an entirely new map with each seed.\nNote: These maps have a chance to generate floors that cannot be completed (stairs set in areas that cannot be reached by the Light Warriors). Use with caution."
	},
	{
		"Id": "procGenEarth2",
		"title": "Generated Earth Cave B2",
		"screenshot": "procGenEarth2.png",
		"description": "Randomly generates the map for the second level of Earth Cave, creating an entirely new map with each seed.\nNote: These maps have a chance to generate floors that cannot be completed (stairs set in areas that cannot be reached by the Light Warriors). Use with caution."
	},
	{
		"Id": "DamageTileDamageSlider",
		"title": "Adjustable Damage for Damage Tiles",
		"screenshot": null,
		"description": "Adjusts the amount of damage that damaging tiles (e.g. lava) deal when you walk on them. If a range is selected, a random value in that range will be chosen for the seed. If 0, then lava won't deal damage at all (but still won't advance encounters).\nCompatible with \"Marsh & Desert Tiles Deal Damage\" and \"Lethal Damage Tiles\"."
	},
	{
		"Id": "OWDamageTilesCheckBox",
		"title": "Marsh and Desert Tiles Deal Damage",
		"screenshot": "marshAndDesertDealDamageCheckBox.gif",
		"description": "Marsh and Desert tiles on the overworld deal damage to the party like Lava and Ice tiles in dungeons."
	},
	{
		"Id": "DamageTilesKillCheckBox",
		"title": "Lethal Damage Tiles",
		"screenshot": "damageTilesKillCheckBox.gif",
		"description": "If a character is at 1 HP, stepping on damage tiles will kill them. If all characters are dead, game over will be triggered."
	},
	{
		"Id": "startingLevelDropDown",
		"title": "Starting Level",
		"screenshot": "startingLevelDropDown.gif",
		"description": "Allows you to change the level your party members will be when you start the game.\nThis is affected by Class XP Bonus settings, so a class with adjusted XP scaling may start with a higher or lower level than set here (but the same amount of XP as the other classes)."
	},
	{
		"Id": "MaximumLevelDoubleSilder",
		"title": "Max Level Cap",
		"screenshot": "MaximumLevelDoubleSilder.png",
		"description": "Allows you to lower the maximum level, increasing the challenge of the given flagset.\nIf a range is selected, a random number is choosen from the range. With a range, there is no way to know what the actual cap is until you reach it.\nIf starting levels are higher than the maximum level, players will start at that level but will be unable to gain levels.\nFor beginners it is not recommended to go below level 20."
	},

	{
		"Id": "deepdungeon",
		"title": "Deep Dungeon",
		"screenshot": "deepdungeon.png",
		"description": "Turns Coneria Castle into a 52-floor completely procedurally generated dungeon.\nAs you go deeper, the treasures get better and the monster encounters get stronger. Every so often there will be a branch to the next town, but dying or restoring a save will return you to the overworld.\nSomewhere within the dungeon is a TAIL and Bahamut; you could encounter them in either order. There are three guaranteed Ribbons and there may be more near the end of the dungeon.\nTreasures are rolled independently, not shuffled, so there could be no Masamunes, or you could find so many you're throwing them on the ground."
	},
	{
		"Id": "DDEvenTreasureDistribution",
		"title": "Distribute Treasure Evenly",
		"screenshot": "ddDistributeEvenly.gif",
		"description": "Instead of the value of treasure chest contents increasing as you progress deeper into the dungeon, each box has the same chance of having any kind of content regardless of where in the dungeon you encounter it."
	},
	{
		"Id": "DDProgressiveTilesets",
		"title": "Progressive Tilesets",
		"screenshot": "deepdungeon.png",
		"description": "Instead of each floor having a random tileset, the first few floors are Castle, the next few floors are Earth/Volcano tileset, and so on, with the final few floors being TOFR tileset. This allows you to have some vague indication of how far into the dungeon you are."
	},
	{
		"Id": "DDFiendOrbs",
		"title": "Fiend Orbs",
		"screenshot": "deepDungeonFiendOrbsCheckBox.png",
		"description": "Instead of the usual NPCs blocking the usual three shortcuts into the dungeon, the fiends guard shortcuts to floors 10, 20, 30, and 40."
	},
	{
		"Id": "TailBahamutDropDown",
		"title": "Bahamut and Tail Floors",
		"screenshot": "tailbahamut.png",
		"description": "Determines how Bahamut and the TAIL are placed in the dungeon relative to each other:\nRANDOM: (Default) They could be placed in either order.\nTAIL FIRST: Always places the TAIL on or before Bahamut's floor.\nBAHAMUT FIRST: Always places the TAIL on or after Bahamut's floor.\nSAME FLOOR: Always places the TAIL and Bahamut on the same floor as each other."
	},
	{
		"Id": "Lockpicking",
		"title": "Thief Lockpicking",
		"screenshot": "Lockpicking.png",
		"description": "Having a thief in the party, when they reach the required level, allows players to open all locked doors. (Selecting level 1 will allow the thief to always unlock doors.)\n\n Enabling this flag also adds a -10 level requirement bonus and a +10 level requirement malus to blursed classes."
	},
	{
		"Id": "ReducedLuckCheckBox",
		"title": "Reduced Starting Luck",
		"screenshot": "ReducedLuck.png",
		"description": "Reduces the starting Luck of all classes by 4. This makes the higher starting Luck of the Thief and Black Mage - as well as any +Luck Blursing bonuses - stand out more meaningfully, and also makes it more of a decision point if you should attempt to run or fight.\nChance to run comparison:\n[grid][r]{i}Vanilla ➔ Reduced |Lvl 2|Lvl 10|Lvl 18|Lvl 25[r]{l}Fighter|29% ➔ 7%|45% ➔ 30%|52% ➔ 40%|56% ➔ 46%[r]{l}Black Mage|57% ➔ 35%|59% ➔ 43%|55% ➔ 43%|52% ➔ 42%[r]{l}Thief|89% ➔ 67%|92% ➔ 77%|94% ➔ 82%|95% ➔ 85%\n\n(Black Belt, Red Mage, and White Mage are all fairly similar to Fighter.)"
	},
	{
		"Id": "WhiteMageHarmEveryoneCheckBox",
		"title": "Improved HARM for White Mage",
		"screenshot": "whiteMageHarmEveryoneCheckBox.gif",
		"description": "HARM spells (including via item magic) will deal damage to any target if CAST or USED by a White Mage/White Wizard. On non-undead targets, the spells will not crit (will not deal double damage except on a 3/256), averaging 30/60/90/120 damage for HARM1-4."
	},
	{
		"Id": "BossExtraTurnsSlider",
		"title": "Boss Extra Turns",
		"screenshot": null,
		"description": "Bosses (Garland, Astos, Warmech, Fiends, and Chaos) will take additional turns per round. This is a flag recommended for advanced players. This flag is not compatable with alternate final formations."
	},
	{
		"Id": "SplitExtraTurnAttacks",
		"title": "Scale Attacks Down To Extra Turns",
		"screenshot": null,
		"description": "When bosses have extra turns, their number of attacks are divided by the number of turns they have (rounded up). In addition the chance to cast spells or skills is reduced if it is greater than 48 (Spells) or 32 (Skills)."
	},
	{
		"Id": "armorCrafterCheckBox",
		"title": "Use Armor Crafter",
		"screenshot": "armorCrafter.png",
		"description": "Generates random armor. Names are assigned based on casting, elemental resistances, or quality. Press 'select' on the equip or shop screen to view exact stats. For chest armor, gauntlet, and helm, class permissions depend on the armor class; otherwise, class permissions depend on the armor type. There will also always be a set of superior armor that is only usable by the Knight.\n[grid][r]{b}Armor Class|{b}Names[r]Inferior|Velvet, Silk, Burlap, Brass, Tin[r]Light|Leathr, Copper, Bronze[r]Medium|Silver, Chain, Mithrl[r]Heavy|Iron, Steel, Gold[r]Superior|Opal, Dragon, Diamnd\n\n[grid]{b}Armor Class / Type|{b}Class Permissions[r]Inferior|all classes[r]Light|Fighter, Thief, Black Belt, Red Mage[r]Medium|Fighter, Ninja, Red Mage[r]Heavy|Fighter, Ninja[r]Superior|Knight[r]Bracelet|all classes[r]Ring (ends with 'R')|all classes[r]Cape (ends with 'C')|Fighter, Thief, Red Mage, White Mage, Black Mage[r]Shirt|Red Wizard, White Wizard, Black Wizard\n\nCheck the Wiki for information on enemy spell/skill elements. If you're also using Blursed Weapons, the names may be easier to understand if you turn on \"Cleaner Blursed Names\" under the Quality of Life tab - this will ensure Cape and Ring equipment always still ends in C or R."
	},
	{
		"Id": "mapgenRNGAccessReqsCheckBox",
		"title": "Randomized Access Requirements",
		"screenshot": "randomizeAccessRequirementsCheckBox.png",
		"description": "Randomize which locations have which access requirements, i.e. whether the SHIP, CANOE, or AIRSHIP is required to access a certain location. Also splits up Coneria and Elfland, placing the towns and castles separately.\nFor example, with this enabled, it could produce a map where you need to go through Titan's tunnel to access the Temple of Fiends, or accessing Elfland requires the CANOE.\nRequires key item shuffle and/or loose items to be enabled."
	},
	{
		"Id": "mapgenUnsafeStartCheckBox",
		"title": "Randomized Access Requirements - Unsafe Start",
		"screenshot": "randomizeAccessRequirementsUnsafe.gif",
		"description": "If enabled, mid-game dungeons (Earth, Volcano, Ice and Ordeals) are added to the pool of possible starting area entrances that may be required for early progression."
	},
	{
		"Id": "everythingHasDeathTouch",
		"title": "Everything has Death Touch",
		"screenshot": "everythingHasDeathTouchCheckBox.png",
		"description": "Adds death touch status attack to every enemy in the game.\nNote: Pirates in Pravoka will not have death touch if they are \"Safe\" Pirates."
	},
	{
		"Id": "everythingHasDeathTouchExcludeFiends",
		"title": "Everything has Death Touch - Exclude Fiends",
		"screenshot": "everythingHasDeathTouchExcludeFiendsCheckbox.png",
		"description": "When adding death touch status attack to every enemy in the game, the four Fiends, their refights, and Chaos are skipped.\nNote: These bosses may still receive death touch when status attacks are shuffled."
	},
	{
		"Id": "increaseDarkPenaltyCheckBox",
		"title": "Increase Dark Penalty",
		"screenshot": "increaseDarkPenaltyCheckBox.png",
		"description": "If enabled, \"Dark\" status severely decreases an attacker's chance to hit or crit an enemy: their crit chance is set to 0%, and they lose all of their base hit chance (this effectively makes the penalty -168 instead of the normal -40), leaving them with only their Hit% vs the defender's Evasion.\nAffects both players and enemies inflicted with \"Dark\" status."
	},
	{
		"Id": "OrbsRequiredModeDropDown",
		"title": "Total Orbs Required",
		"screenshot": "orbsRequiredDropDown.png",
		"description": "Changes the total number of ORBS needed to enter the Temple of Fiends Revisited.\n[grid][r]{i}Option|{i}Explained[r]{l}4|{l}(Vanilla Behavior) All 4 ORBS are required[r]{l}Any 3|{l}Any combination of 3 ORBS are accepted[r]{l}Any 2|{l}Any combination of 2 ORBS are accepted[r]{l}Any 1|{l}Any single ORB is accepted[r]{l}Specific 3|{l}3 Randomly selected ORBS are required[r]{l}Specific 2|{l}2 Randomly selected ORBS are required[r]{l}Specific 1|{l}1 Randomly selected ORB is required[r]{l}0|{l}No ORBS are required\n\n\"Total Orbs Required: Random\" will pick a number 1 - 3.\n\nGoing above the minimum ORB requirement will still grant access to ToFR.\nThis option is ignored if Shard Hunt or Deep Dungeon is enabled."
	},
	{
		"Id": "orbsRequiredSpoilersCheckbox",
		"title": "Orbs Required - Orb Spoilers",
		"screenshot": "orbsRequiredSpoilersCheckBox.png",
		"description": "When enabled, the Black Orb will explain its requirements."
	},
	{
		"Id": "noConsecutiveNukesCheckBox",
		"title": "Prevent Consecutive NUKE or NUCLEAR",
		"description": "When shuffling spell and skill scripts, prevent consecutive casts of NUKE or NUCLEAR without at least one other spell or skill in between.  Also prevents having the starting spell and skill slots filled by both NUKE and NUCLEAR at the same time. (Because one is a spell and one is a skill, it's still rarely possible for NUKE to be activated immediately after NUCLEAR - or vice-versa - later in the fight.)"
	},

	{
		"Id": "beginnerPresetToolTipBox",
		"title": "Beginner Preset",
		"description": "Introduction to the randomizer, and the basis for most of the other presets."
	},
	{
		"Id": "improvedVanillaPresetToolTipBox",
		"title": "Improved Vanilla Preset",
		"description": "Applies the bugfixes and quality-of-life improvements to the base game, but does not randomize anything.\nPrices and level up requirements are halved for a less grindy experience - if you would prefer to play with original pricing and XP, move the \"Exp. & Gold Boost\" slider on the Scale tab down to 1.0x (or your desired value)."
	},
	{
		"Id": "deepDungeonPresetToolTipBox",
		"title": "Deep Dungeon Preset",
		"description": "Turns Coneria Castle into a 52-floor completely procedurally generated dungeon, leading to Chaos.\nAs you go deeper, the monster encounters get stronger. Every so often there will be a branch to the next town, but dying or restoring a save will send you back to start.\nKey flags\n- Save on game over\n- Save items replaced by ethers that restore magic charges\n- The Tail can be found between floors 10 and 30, before Bahamut.\n[grid][r]Towns|Level[r]Pravoka|between 2 and 6[r]Elfland|between 9 and 13[r]Melmond|between 16 and 20[r]Crescent Lake|between 23 and 27[r]Onrac|between 30 and 34[r]Gaia|between 37 and 41[r]Lefein|between 44 and 48"
	},
	{
		"Id": "overRandomizerToolTipBox",
		"title": "Over Randomizer Preset",
		"description": "The randomizer will give you entirely new weapons, armor, spells, and enemies.\nKey flags\nWeaponizer & Armor Crafter - see tooltips on the 'Gear & Items' tab\nEnemizer & Spell Crafter - See the FAQs on the Wiki, under Randomizer Documentation."
	},
	{
		"Id": "chaosRushToolTipBox",
		"title": "Chaos Rush Preset",
		"description": "You can challenge Chaos immediately at the start of the game.  How fast can you become strong enough to defeat Chaos?\nKey flags\n- No Orbs are required, ToFR is unlocked, and you start with the LUTE\n- Your 4 Light Warriors are chosen for you\n- Free Ship, Canoe and Airship\n- Free TAIL\n- High XP and gold scaling\n- Low encounter rate\n- Short ToFR"
	},
	{
		"Id": "hiddenChaosToolTipBox",
		"title": "Hidden Chaos Preset",
		"description": "Chaos is hidden in a random chest and must be found to be defeated. Once you've killed Chaos the game ends. If you find Chaos and then lose, fear not -- the fiend will not move and can be tracked down to the same treasure chest to be fought again.\nKey flags\n- Randomized treasure, high wealth\n- Rare and legendary gear in shops\n- All 4 Orbs are lit, ToFR is unlocked, and you start with the LUTE, but is anyone home?"
	},
	{
		"Id": "entranceFloorShufflePresetToolTipBox",
		"title": "Entrance and Floor Shuffle Preset",
		"description": "Overworld entrances (except for towns) are shuffled together, as are cave and dungeon floors.  For example, the entrance to Waterfall could lead to Earth B1, which may lead to Volcano B3, which leads to Matoya's Cave, etc.\nKey flags\n- Dungeon encounter rate is slightly lower than Beginner flagset"
	},
	{
		"Id": "noverworldShufflePresetToolTipBox",
		"title": "NOverworld Preset",
		"description": "Removes the overworld from the game entirely - towns and dungeons are connected directly by stairs and warps.  Introduces two new items, the SIGIL and the MARK, which you must find to unlock progression.\nKey flags\n- Save on death\n- Save items replaced with ethers, which restore magic charges\n- Start with a random item that casts offensive area-of-effect magic"
	},
	{
		"Id": "shardHuntPresetToolTipBox",
		"title": "Shard Hunt",
		"description": "The orbs have been shattered and spread across the world.  Find 28 Shards to unlock the Temple of Fiends.  Defeating Lich or Kary award 2 Shards; Kraken or Tiamat award 4 Shards.\nKey flags\n- Dungeon encounter rate is slightly lower than Beginner flagset"
	},
	{
		"Id": "oopsAllLooseToolTipBox",
		"title": "Oops, All Loose!",
		"description": "All key items are loose, which means they can be found in any chest.  There may be multiple key items in a dungeon, or none at all.\nKey flags\n- Dungeon encounter rate is slightly lower than Beginner flagset"
	},
	{
		"Id": "procgenOWPresetToolTipBox",
		"title": "Procedurally Generated Overworld",
		"description": "Explore a completely new, randomly generated overworld.\n- Be aware you will likely need to find the bridge, which will be found in an early game chest.\n- The CANAL is required to access a dock that lets you reach the Earth cave.\n- The Airship can be found in a distinctive area of desert surrounded by mountains and entered from the south.\n- The overworld encounter rate is reduced to assist exploring."
	},
	{
		"Id": "floaterlessPresetToolTipBox",
		"title": "Floaterless",
		"description": "Sail the high seas!  The Floater has been removed from the game, so you can't get the airship, but new docks, rivers and mountain passes have been added to ensure you can still get everywhere you need to go.\nKey flags\n- Northern docks let you access the Onrac continent, Bahamut's island, and the Mirage desert.\n- A new river dock grants access to the Lefein region, and a mountain pass provides access to Gaia.\n- Overworld encounter rate is reduced"
	},
	{
		"Id": "freeEnterpriseToolTipBox",
		"title": "Free Enterprise",
		"description": "All bosses rush modeled after the open world gameplay style of FF4: Free Enterprise.  Go anywhere in your trusty airship, the Enterprise.  The LUTE, KEY and lighting the four orbs are still required to access the final dungeon.\n- Free airship and canoe\n- Starting party is two forced, two none.  You will have the opportunity to recruit additional party members by completing quests and defeating fiends.\n- No random encounters; gain XP by finding XP chests, taking spike tile fights, and defeating bosses.\n- Every incentive location is in play, with a key item or legendary treasure\n- Randomized treasure, high wealth, rare and legendary gear in shops\n- Start with a random item that casts offensive area-of-effect magic\n- Free TAIL, fight buff Bahamut\n- Buffed, unsafe pirates\n- Buffed Astos\n- Required WarMECH\n- Alternate fiends and final boss\n- Short ToFR"
	},
	{
		"Id": "swoleAstosCheckBox",
		"title": "Buffed Astos",
		"screenshot": "buffedAstosCheckBox.png",
		"description": "Astos becomes as strong as a fiend, with extremely high evasion, nasty spells and skills, and a high XP reward. He likes to utilize Status and Death magic - but is also vulnerable to the same.\n(Buffed Astos will retain their nasty spell & skill set regardless of Script Shuffle settings.)"
	},
	{
		"Id": "unsafeAstosCheckBox",
		"title": "Unsafe Astos",
		"screenshot": "unsafeAstosCheckBox.png",
		"description": "Shuffle Astos may place Astos on the King or Princess of Coneria Castle.  This may result in challenging early game progression."
	},
	{
		"Id": "tranceHasStatusElement",
		"title": "TRANCE is Status Element",
		"description": "Adjust enemy skill TRANCE to have 'status' element, so it can be resisted by wearing a Ribbon, casting ARUB, or with other status-protecting spells and gear that may be generated by other flags."
	},
	{
		"Id": "lockRespondRateCheckBox",
		"title": "Lock Respond Rate",
		"screenshot": "lockRespondRateCheckBox.png",
		"description": "Pressing LEFT or RIGHT on the Title Screen will not change the Respond Rate from its preferred value of 8.\nThis prevents accidental changes to the text speed during gameplay."
	},
	{
		"Id": "uninterruptedMusicCheckBox",
		"title": "Uninterrupted Music",
		"description": "Modifies the chime that plays when opening standard treasure chests so music keeps playing instead of restarting after every chest. (Incentivized items playing the longer fanfare tune remain unchanged.)"
	},
	{
		"Id": "relocateChests",
		"title": "Relocate Chests & Trap Tiles",
		"screenshot": "shufflechests.png",
		"description": "Relocate chests and enemy trap tiles to new locations in castles and dungeons.\n(\"Linked\" chests, where multiple chest locations give the same treasure and result in empty chests, are removed.)"
	},
	{
		"Id": "markRelocatedTrapTiles",
		"title": "Relocated Trap Tiles Are Marked",
		"screenshot": "markedTrapTile.png",
		"description": "Relocated trap tiles will be marked."
	},
	{
		"Id": "OpenChestsInOrder",
		"title": "Open Chests In Order",
		"description": "Non incentive items are opened in order. \n\nWarning, if your inventory gets full it will block your equipment progress."
	},
	{
		"Id": "AirBoatCheckBox",
		"title": "AirBoat",
		"screenshot": "airboat.gif",
		"description": "The Ship and the Airship are fused together. Getting the FLOATER allows the Ship to transform into the Airship, and the Airship can land on water. You can't raise the Airship from the desert anymore."
	},
	{
		"Id": "moveToFBats",
		"title": "Move Temple of Fiends Bats",
		"screenshot": "moveToFBats.png",
		"description": "Temple of Fiends bats are moved out of Garland's room."
	},
	{
		"Id": "ShuffleChimeAccess",
		"title": "Shuffle Chime Access",
		"description": "Shuffle the CHIME access requirement to another entrance.  This means Mirage Tower won't require the CHIME to enter, but some other dungeon, cave or castle will be impossible to enter without the CHIME, unless CHIME access is shuffled back to Mirage.\n (CUBE is still required to reach the Sky Palace)."
	},
	{
		"Id": "ShuffleChimeIncludeTowns",
		"title": "Shuffle Chime includes Towns",
		"description": "Include towns (except Coneria) in the pool of entrances that may require CHIME to enter."
	}
]
